[
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "ABS",
    "glossary_slug": "abs",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724755173.png",
    "glossary_image_path": "abs.jpg",
    "glossary_description": "Antilock braking system is an enhanced braking system that monitors individual wheel rotation and prevents the wheels from locking up while stopping. Locked wheels provide inefficient braking and sacrifice directional control, so ABS shortens stopping distances in most conditions and allows the driver to steer even when panic braking. The federal government began requiring ABS on all new cars starting with the 2012 model year. Pulsation in the brake pedal can startle the uninitiated, but it is a sign of the ABS properly doing its job.  In structure, ABS is similar to a conventional braking system, but its components may need repair, starting with electronic wheel sensors at each wheel or at the differential, the computer brain called the control module, and a valve assembly and pump.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/abs/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "ABS control module",
    "glossary_slug": "abs-control-module",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035425991.png",
    "glossary_image_path": "abs-control-module.jpg",
    "glossary_description": "The ABS control module is a microprocessor that runs diagnostic checks of a vehicle’s antilock braking system and processes information from wheel-speed sensors and the hydraulic brake system to determine when to release braking pressure at a wheel that’s about to lock up and start skidding.  Antilock brakes have been available since the 1980s and are standard on all 2012 model-year and later vehicles because they’re an integral part of electronic stability control, which has been required since 2012. Antilock systems prevent skids when braking, and stability control intervenes to prevent skids even when the brakes aren’t applied.  A dashboard ABS warning light is supposed to come on for a few seconds every time a vehicle is started, but if it comes on while driving it signals that the control module has conked out, a wheel sensor has failed or another problem has developed.  On many vehicles, the brakes should still operate normally when the warning light is on, but the antilock function won’t work. On some vehicles, though, braking ability will be reduced if the antilock system malfunctions, and stability control and traction control (on vehicles with those features) might also be disabled.  An ABS warning light usually triggers a trouble code that can be read with a diagnostic tool to help mechanics pinpoint the problem.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/abs-control-module/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "ABS wheel speed sensor",
    "glossary_slug": "abs-wheel-speed-sensor",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Sensors mounted at each wheel that monitor the speed at which the wheels are turning. If one is turning slower than the others during braking, that indicates it is locking up, which could cause skidding and loss of steering control. ABS is supposed to intervene by rapidly “pumping” the brakes at the wheel that is locking up, allowing it to spin so that the driver retains braking and steering control.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/abs-wheel-speed-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake booster",
    "glossary_slug": "brake-booster",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724882450.png",
    "glossary_image_path": "brake-booster.jpg",
    "glossary_description": "In power brake systems, which are found on virtually all vehicles, the brake booster is a component that multiplies the force the driver applies to the brake pedal. If the booster fails, excessive pedal force will be required to achieve adequate braking.  Most brake boosters run on a vacuum produced by the engine. The cause of booster failure can be as simple as a loose vacuum hose or a ruptured diaphragm that requires component replacement.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-booster/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake caliper",
    "glossary_slug": "brake-caliper",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724944330.png",
    "glossary_image_path": "brake-caliper.jpg",
    "glossary_description": "In disc-brake systems, a caliper is a set of metal jaws that clamps down on a wheel’s brake disc, or rotor, when the driver applies the brakes. The caliper presses brake pads against either side of the disc, creating friction that slows the disc’s rotation and thus the wheel to which it is attached, slowing and stopping the car.  Unlike brake pads and rotors, calipers typically last many years and for tens of thousands of miles, but occasionally they seize or begin to leak and need to be rebuilt or replaced.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-caliper/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake fluid",
    "glossary_slug": "brake-fluid",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724989904.png",
    "glossary_image_path": "brake-fluid.jpg",
    "glossary_description": "Brake fluid transfers the force of your foot pressing on the brake pedal to the brakes at all four wheels. Fluid-filled, air-free channels extend from the master cylinder in the engine compartment through brake lines (rigid tubes) and flexible hoses to cylinders that activate calipers or drum brakes. In newer cars, antilock braking system hardware is an intermediate component.  Brake fluid reservoirs are often constructed of translucent plastic to simplify checking the fluid level. Some cars incorporate a warning light to indicate if the level drops too low. A healthy brake system won’t lose fluid, though the level may decrease as the brake pads wear. Dramatic fluid loss is cause for investigation.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-fluid/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake hose",
    "glossary_slug": "brake-hose",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725029691.png",
    "glossary_image_path": "brake-hose.jpg",
    "glossary_description": "Unlike the brake lines, which are metal tubes that run the length of the car, the short brake hose found at each wheel is made of rubber. The hose’s job is to carry brake fluid from a brake line fixed to the car’s body the rest of the way to the brake caliper on the wheel. Its flexibility is what allows the wheel to move with the suspension.  Brake hoses are intended to last for years and tens of thousands of miles, but they should be inspected regularly for damage, cracks or other signs of degradation, and replaced, if needed.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-hose/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake master cylinder",
    "glossary_slug": "brake-master-cylinder",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725222380.png",
    "glossary_image_path": "brake-master-cylinder.jpg",
    "glossary_description": "The brake master cylinder is the first component in a vehicle’s braking system, activated by depressing the brake pedal. The pedal pushes a piston through this cylinder, forcing brake fluid through brake lines to slave cylinders at each wheel, which in turn drive the pistons that force friction material against the wheel hubs, stopping the wheel.  The master cylinder is designed to last the life of the car, but like brake calipers, sometimes it can spring leaks or otherwise fail, and it must be rebuilt or replaced. The master cylinder is topped by the brake-fluid reservoir, which must be kept full.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-master-cylinder/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake pad",
    "glossary_slug": "brake-pad",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725064766.png",
    "glossary_image_path": "brake-pad.jpg",
    "glossary_description": "In disc-brake systems, the brake pads are the friction material the caliper squeezes against the rotating disc, or rotor, to slow the wheel’s rotation and stop the car. In drum brakes, the pads are called shoes.  Subject to tremendous friction and heat, brake pads wear down and must be replaced as part of a car’s regular maintenance. How long they last depends both on the car’s design and how it is driven.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-pad/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake rotor",
    "glossary_slug": "brake-rotor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725259255.png",
    "glossary_image_path": "brake-rotor.jpg",
    "glossary_description": "The technical name for the disc in disc brakes, the rotor is a metal platter that’s part of the hub to which a car’s wheel attaches. It rotates with the wheel, so when the driver applies the brakes, causing the calipers to squeeze their brake pads against the rotors, the resulting friction slows the wheels’ rotation and stops the car.  Rotors are durable and intended to last longer than brake pads, but they aren’t designed to last forever. When worn down, they must be replaced. If rotors become warped or pitted, sometimes they can be machined (also called “resurfaced” or “turned”), but rotor prices have come down enough that replacement is more common than it used to be",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-rotor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Brake shoe & drum",
    "glossary_slug": "brake-shoe-drum",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "With drum brakes, a hydraulic cylinder/piston complement between two brake shoes then pushes each shoe outward and into contact with the inner surface of the rotating drum. The brake shoe lining material creates friction against the drum, which slows and ultimately stops the wheel. Brake shoe material is designed to prevent noise and withstand excessive heat.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/brake-shoe-and-drum/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "AC compressor",
    "glossary_slug": "ac-compressor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035472574.png",
    "glossary_image_path": "ac-compressor.jpg",
    "glossary_description": "The compressor is the power unit of the air-conditioning system that puts the refrigerant under high pressure before it pumps it into the condenser, where it changes from a gas to a liquid.  A fully functioning compressor is necessary for the air-conditioning system to provide peak performance. On most cars, A/C compressors are driven by an engine-accessory belt. If the belt is worn and slips, the compressor won’t operate at full strength. Compressors can also leak refrigerant, resulting in less cold air going into the interior. Internal parts can also fail, leading to no cold air.  Not all air-conditioning problems are because the system is low on refrigerant. Some are caused by issues with system parts, such as the compressor.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ac-compressor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "AC condenser",
    "glossary_slug": "ac-condenser",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725296424.png",
    "glossary_image_path": "ac-condenser.jpg",
    "glossary_description": "The air-conditioning condenser is a radiator positioned between the car’s grille and the engine-cooling radiator in which the gaseous refrigerant sheds heat and returns to a liquid state. The liquid refrigerant flows to the evaporator inside the dashboard, where it cools the cabin.  Not cool enough for you? It might result from a clogged air-conditioning condenser or disabled cooling fan. A leak in the condenser will also result in a loss of refrigerant.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ac-condenser/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "AC evaporator",
    "glossary_slug": "ac-evaporator",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724159121.png",
    "glossary_image_path": "ac-evaporator.jpg",
    "glossary_description": "The air-conditioning evaporator is a small radiator inside the dashboard that provides cold air for the air-conditioning system. It’s called the evaporator because it’s where the freezing liquid refrigerant takes on any heat from the air blown through it and changes into a gaseous state (evaporating it) before returning it to the air-conditioning condenser to shed the heat; the process is constantly repeated. The air that emerges from the air conditioner is cold as a result.  The evaporator is typically hidden inside the vehicle’s dashboard and can be labor-intensive to replace, which then requires a full system recharge. Unlike a ruptured heater core, which can leak engine coolant into the foot wells, a leak in the evaporator releases only refrigerant vapor. A clogged drainage channel is a common cause of water in the front foot wells.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ac-evaporator/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "AC recharge",
    "glossary_slug": "ac-recharge",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "When your air conditioner blows only mildly cool air or no cool air at all, it’s probably low on refrigerant, the gas that many people still refer to as “Freon” but which now is a different substance, R-134, that’s less damaging to the environment. That means it’s probably time for an A/C recharge, but there’s more to it than just filling ’er up.  Because the refrigerant operates in a closed system, the most likely cause for low levels is a leak in the air-conditioning system. The most common practice by repair shops is for a qualified technician to inspect the system for obvious leaks, such as in hoses, pipes or the air-conditioning compressor, and make repairs as necessary.  Can you save money by merely topping off the system with refrigerant? Possibly. Could you even do it yourself? Yes (kits are available from parts stores). But there are a couple of major issues with that approach. There’s no way of knowing how much refrigerant is left in the system, so even a qualified technician would have to guess as to how much to add to top it off. Systems vary, but each one holds a specific amount of refrigerant. The only way to know it’s full is to evacuate the system and fill it with the specified amount.  Secondly, topping off the refrigerant doesn’t fix leaks or whatever other issue caused the system to run low, so it’s only a temporary fix at best. The air conditioner might work for a while, but most systems are designed to shut down once the refrigerant falls to a certain level, and eventually you’ll be back to only warm air.  Small leaks, such as pinholes in hoses, can be hard to find, so the work might not be done even after a complete evacuation and recharge. The air conditioner might stop working after a few days, and when you return to the shop they might have to inject dye into the system and trace it with a black light for leaks, which could be in a hidden location such as the A/C evaporator, which is behind the dashboard.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ac-recharge/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "Air conditioning diagnosis",
    "glossary_slug": "air-conditioning-diagnosis",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035301892.png",
    "glossary_image_path": "air-conditioning-diagnosis.jpg",
    "glossary_description": "Your air conditioning system is really part of a larger system, known as the HVAC (heating, ventilation and air-conditioning) system. Your A/C system includes a condensor, evaporator and the cabin air filter.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/air-conditioning-diagnosis/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Cabin air filter",
    "glossary_slug": "cabin-air-filter",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725403718.png",
    "glossary_image_path": "cabin-air-filter.jpg",
    "glossary_description": "The cabin air filter serves to clean the air drawn in by your car’s ventilation system. A car may have multiple filters to achieve different objectives, such as to limit pollen or odors, to provide sequential filtering or just for “packaging” reasons: to provide enough filtering and airflow in a tight space.  Manufacturers commonly recommend filter replacement every one to two years, but it depends on the car, filter type and how dusty your environment is; check your owner’s manual for recommendations. Odors, inadequate airflow and disproportionately loud fan noise are signs that the filter needs replacement.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/cabin-air-filter/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Heater blower motor",
    "glossary_slug": "heater-blower-motor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036507866.png",
    "glossary_image_path": "heater-blower-motor.jpg",
    "glossary_description": "The blower motor is the fan that pushes heated or cooled air through dashboard vents based on the climate system settings and the fan speed selected.  Adjusting the fan speed sends a signal through a resistor to the blower motor to either pick up the pace or slow it down. The blower motor resistor adjusts the amount of current going to the blower motor based on the selected fan speed.  When a blower motor fails, only a small amount of air will come through the interior vents based on the amount of outside air entering the climate system.  If the fan doesn’t work, before pointing the finger at the blower motor, check fuses for the motor to make sure they’re still good. Many vehicles have two fuses for the blower motor, one in the interior fuse block and the other under the hood. The blower motor is usually under the dashboard on the passenger side.  Blower motors that make loud squeaks or rattling noises may be worn out and on the verge of packing it in, but sometimes those noises are caused by leaves or other debris that can be cleaned out after the motor is removed from the vehicle.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/heater-blower-motor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Heater blower motor resistor",
    "glossary_slug": "heater-blower-motor-resistor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036541265.png",
    "glossary_image_path": "heater-blower-motor-resistor.jpg",
    "glossary_description": "The heater blower motor reduces or increases the amount of air blowing through the dashboard vents based on the fan speed selected or, in an automatic climate control system, the interior temperature and other factors. But resistors, small electronic parts tucked out of sight, are what actually control the fan speed by reducing the amount of electrical current going to the blower motor.  When everything is working properly, setting the fan speed at its lowest setting, for example, will tell the resistor to restrict the amount of current to a low level. But if the resistor burns out or wears out from corrosion, there is nothing to reduce the amount of voltage going to the blower motor for the lowest fan speed, so it will most likely get the maximum current and run at full speed.  When a resistor fails, the fan will often run only at higher speeds or the highest speed, no matter what fan speed is selected. In some vehicles, though, the fan may not work at all, and only a little may come through the vents.  If little air is coming through the vents (hot or cold), then it could be because the blower motor for the fan or a switch or resistor that controls fan speed isn’t working. Another cause might be that the electronically controlled “blend doors” that direct air flow are stuck or broken.  The fan switch may be at fault, but a more likely reason is that a blower motor resistor that controls the voltage going to the blower has packed it in, resulting in only one speed remaining operable – usually the highest speed.  When a blower resistor fails, the highest fan speed usually is the only one that still works because it essentially bypasses the resistor and receives the maximum amount of voltage. When the resistor is working, it reduces the amount of voltage going to the lower fan speeds so the fan runs slower.  Blower resistors are small parts that can become corroded or just burn out, and a new one often costs less than $50. Because they’re usually under the dashboard on the passenger’s side or behind the glove box, near the blower motor, they can be hard to reach if they need to be replaced.  Though having only one fan speed usually indicates a bad blower resistor, diligent mechanics will test the resistor, fan switch and connections to the blower motor to make sure before they start replacing parts. If none of the fan speeds work, then checking the fuse or fuses for the heating, vent and air conditioning systems is a logical first step.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/heater-blower-motor-resistor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Coolant",
    "glossary_slug": "coolant",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725450783.png",
    "glossary_image_path": "coolant.jpg",
    "glossary_description": "Coolant, technically called engine coolant, is the liquid that circulates through your engine and radiator to maintain the desired operating temperature. Often mistakenly called antifreeze, coolant is a mixture of water and antifreeze, which is a liquid that prevents not just freezing but also boiling, either of which could cause the engine to overheat. (Coolant is not to be confused with refrigerant, the pressurized gas that allows the air conditioning to keep the cabin cool.)  Engine coolant should be checked according to the manufacturer’s recommendation (check your owner’s manual) to ensure there’s enough, and that it’s in good condition. A replacement interval is also provided in the manual, and it varies with the make and model.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/coolant/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Coolant leak diagnosis",
    "glossary_slug": "coolant-leak-diagnosis",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Coolant, technically called engine coolant, is the liquid that circulates through your engine and radiator to maintain the desired operating temperature. Often mistakenly called antifreeze, coolant is a mixture of water and antifreeze, which is a liquid that prevents not just freezing but also boiling, either of which could cause the engine to overheat.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/coolant-leak-diagnosis/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "E",
    "glossary_category_slug": "e",
    "glossary_short_name": null,
    "glossary_long_name": "Engine cooling system",
    "glossary_slug": "engine-cooling-system",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724101107.png",
    "glossary_image_path": "engine-cooling-system.jpg",
    "glossary_description": "A vehicle’s engine-cooling system serves not just to keep the engine cool, but to also keep its temperature warm enough to ensure efficient, clean operation. System components include a radiator to dissipate heat, a fan or fans to ensure adequate airflow for radiator cooling, a thermostat valve that opens when the desired operating temperature is reached and a water pump (or coolant pump) to circulate coolant through the engine, hoses and other components. Most vehicles now employ an expansion tank that allows the coolant to expand, and exit, the cooling circuit when hot, and to return when the car is turned off and the engine cools.  The cooling system also incorporates elements of the cabin’s ventilation system, because engine heat is used to warm the car’s interior.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/engine-cooling-system/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Heater core",
    "glossary_slug": "heater-core",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725491633.png",
    "glossary_image_path": "heater-core.jpg",
    "glossary_description": "The heater core is a small radiator that warms the car’s cabin using hot coolant from the engine. The cooling system’s hoses circulate liquid coolant through the heater core as they do through the engine and large cooling radiator behind the vehicle’s grille.  A failed heater core is a common source of liquid in the vehicle’s front foot wells, with steam coming from the air vents or excessive fogging of inside windows. A sweet coolant odor is another sign of failure. Replacement costs depend primarily on labor: how easily the core can be removed, whether from the interior or the engine compartment.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/heater-core/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Heater hose",
    "glossary_slug": "heater-hose",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724197650.png",
    "glossary_image_path": "heater-hose.jpg",
    "glossary_description": "Heater hoses are rubber hoses that circulate engine coolant to and from the heater core, which is the small radiator that provides heat for the cabin. They typically extend from the engine to the firewall, because the core is located inside the vehicle’s dashboard.  Relatively inexpensive, heater hoses should be kept in good condition to prevent leaks or ruptures that would jeopardize engine cooling.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/heater-hose/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "R",
    "glossary_category_slug": "r",
    "glossary_short_name": null,
    "glossary_long_name": "Radiator",
    "glossary_slug": "radiator",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036757081.png",
    "glossary_image_path": "radiator.jpg",
    "glossary_description": "The radiator is Grand Central Station for an engine’s cooling system: The mixture of antifreeze and water that cools the engine continually passes through the radiator, where it discharges some of the heat it picked up from the engine and takes in cooler air before circulating again through passages around the engine. A spur line sends warm coolant to the heater core to generate heated air for the interior when needed.  A water pump circulates the coolant around the engine, and a thermostatically controlled fan behind the radiator turns on as needed to draw more air through the radiator to help cool the antifreeze/water mixture.  Though most modern radiators are made of aluminum and plastic and are generally thought to be rust-resistant, the metal can still corrode. Antifreeze contains rust inhibitors that break down over time, allowing corrosion to damage cooling fins inside the radiator and rust to eat through from the inside and cause leaks. Some radiators also have plastic parts that can develop cracks and leak.  That is why many vehicle manufacturers recommend changing the engine coolant and flushing the system periodically, though in some cases that isn’t for 100,000 miles or more. Some manufacturers say the coolant never has to be changed and only the coolant level needs to be checked periodically. Repair shops can test coolant for corrosion resistance and for protection against freezing.  Debris such as dirt, leaves and plastic bags can collect on radiators and reduce their cooling ability. Hoses connected to the radiator and radiator caps also can develop leaks, and thermostats that regulate coolant flow can fail. Having a repair shop do a full cooling system inspection should be part of regular maintenance on vehicles more than five years old or that have more than 50,000 miles on the odometer.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/radiator/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "R",
    "glossary_category_slug": "r",
    "glossary_short_name": null,
    "glossary_long_name": "Radiator/cooling fan",
    "glossary_slug": "radiatorcooling-fan",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725571479.png",
    "glossary_image_path": "radiatorcooling-fan.jpg",
    "glossary_description": "The radiator fan (or fans) pulls cooling air through the car’s radiator. Positioned between the radiator and engine, cooling fans are particularly helpful when the car is stationary or moving at speeds too slow to force air through the grille. The advent of electric cooling fans, which turn on and off as needed, proved an improvement over engine-driven fans that slow down exactly when they’re needed most.  A failed cooling fan can result in an engine overheating. These fans sometimes double as a cooling source for the cabin air conditioning’s condenser.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/radiatorcooling-fan/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "R",
    "glossary_category_slug": "r",
    "glossary_short_name": null,
    "glossary_long_name": "Radiator hose",
    "glossary_slug": "radiator-hose",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725617265.png",
    "glossary_image_path": "radiator-hose.jpg",
    "glossary_description": "Radiator hoses are large-diameter rubber hoses that carry engine coolant between the engine and radiator and back toward the water pump.  Radiator hoses should be inspected as part of routine maintenance to ensure their integrity. Signs of damage or deterioration call for a precautionary repair that’s much easier and less disruptive than the alternative.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/radiator-hose/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "W",
    "glossary_category_slug": "w",
    "glossary_short_name": null,
    "glossary_long_name": "Water pump",
    "glossary_slug": "water-pump",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725663110.png",
    "glossary_image_path": "water-pump.jpg",
    "glossary_description": "The water pump (technically the coolant pump) is powered by the engine and circulates liquid coolant through the engine cooling system.  Leaks and noise are signs of water pump failure, which can be caused by age and wear or overheating conditions, and are often caused by other faults in the system. It’s driven by a belt (whether a dedicated serpentine or rarely by the timing belt), so proper belt maintenance is critical to its operation. Because of its location, it may be wise to replace an older water pump, even if it’s still functioning, while replacing a timing belt because the labor involved is costly.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/water-pump/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Clutch cable",
    "glossary_slug": "clutch-cable",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035576228.png",
    "glossary_image_path": "clutch-cable.jpg",
    "glossary_description": "On many vehicles with manual transmissions, a steel cable connected from the clutch pedal lever to the clutch itself is what disengages the clutch when the pedal is depressed. Pushing in the pedal pulls the steel cable, which is covered by a heavy sheath, and the cable extends to disengage the clutch and let the driver smoothly shift gears.  Hydraulic clutches don’t have cables. Instead, pushing in the clutch pedal forces fluid to flow from a master cylinder to a “slave cylinder” that moves the pressure plate and disengages the clutch. Some older clutches have mechanical linkage with rods and levers instead of a cable.  Clutch cables usually last for years, but they can fray or break. Signs of wear include the clutch pedal becoming harder to push down or not springing back up when released (which could also be caused by a worn or broken return spring).  Cables can also loosen or stretch from use so that the clutch doesn’t fully release when the pedal is pushed all the way in. Loose cables can often be adjusted, but some may need to be replaced.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/clutch-cable/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Clutch slave cylinder",
    "glossary_slug": "clutch-slave-cylinder",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Hydraulic clutches for manual transmissions use brake fluid to supply pressure to disengage the clutch from the engine. Pushing in the clutch pedal makes fluid flow from a master cylinder (or fluid reservoir) to the slave cylinder, which moves the pressure plate, allowing the driver to shift gears.  Seals and hoses can leak, and if enough fluid doesn’t reach the slave cylinder the clutch pedal may go all the way to the floor or the driver may not be able to shift gears. Air can also get into the hydraulic system, causing the clutch pedal to feel spongy. Some slave cylinders are mounted on the outside of a manual transmission, while others are inside the transmission bell housing.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/clutch-slave-cylinder/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Crankshaft",
    "glossary_slug": "crankshaft",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725750755.png",
    "glossary_image_path": "crankshaft.jpg",
    "glossary_description": "The crankshaft is a hardened-steel shaft running the length of the engine that converts the linear force of the moving pistons into rotational force. To use the bicycle analogy, the cyclist’s legs are the pistons, and the pedals and crank are the crankshaft.  A failure in the crankshaft or piston connecting rods typically produces loud knocking or banging sounds from the engine and represents expensive repairs in the form of an engine rebuild or replacement.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/crankshaft/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "D",
    "glossary_category_slug": "d",
    "glossary_short_name": null,
    "glossary_long_name": "Differential",
    "glossary_slug": "differential",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724283156.png",
    "glossary_image_path": "differential.jpg",
    "glossary_description": "The differential is a system of gears that allows different drive wheels (the wheels to which power is delivered from the engine) on the same axle to rotate at different speeds, such as when the car is turning. A differential is also the component through which a rotating driveshaft can change direction; for example, in a rear-wheel-drive car whose driveshaft runs the length of the car, it joins and transfers its power to an axle that runs perpendicular to the car to drive the left and right wheels.  Differentials are low-maintenance, sealed components that are expected to last the life of the vehicle but may have a recommended service interval to check and/or replace the oil. Note that a car with four-wheel drive can have two or more differentials. A failing differential can cause vibration, binding during turns and/or sounds ranging from clunking to howling.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/differential/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "D",
    "glossary_category_slug": "d",
    "glossary_short_name": null,
    "glossary_long_name": "Drivetrain",
    "glossary_slug": "drivetrain",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724243911.png",
    "glossary_image_path": "drivetrain.jpg",
    "glossary_description": "A vehicle’s drivetrain includes all the components that make it move, from the engine to the wheels. The intermediate elements are the transmission, driveshaft(s) and drive axles. The parts between the transmission and wheels, which can comprise either two- or four-wheel-drive components, are known as the driveline.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/drivetrain/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "U",
    "glossary_category_slug": "u",
    "glossary_short_name": null,
    "glossary_long_name": "Universal joint",
    "glossary_slug": "universal-joint",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036990528.png",
    "glossary_image_path": "universal-joint.jpg",
    "glossary_description": "Universal joints allow drive shafts to move up and down with the suspension while the shaft is moving so power can be transmitted when the drive shaft isn’t in a straight line between the transmission and drive wheels.  Rear-wheel-drive vehicles have universal joints (or U-joints) at both ends of the drive shaft. U-joints connect to yokes that also allow drive shafts to move fore and aft as vehicles go over bumps or dips in the road, which effectively shortens or lengthens the shaft.  Front-drive vehicles also use two joints, called constant velocity (or CV) joints, but they are a different kind that also compensate for steering changes.  On rear-drive vehicles, one sign of a worn U-join is a “clank” sound when a drive gear is engaged. On front-drive vehicles, CV joints often make a clicking noise when they’re worn. CV joints are covered by protective rubber boots, and if the boots crack or are otherwise damaged, the CV joints will lose their lubrication and be damaged by dirt and moisture.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/universal-joint/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Battery replacement",
    "glossary_slug": "battery-replacement",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "If you own or lease a vehicle for more than three years, at some point you’ll have to replace the battery. Over time, a battery’s capacity to store electricity will diminish, or it will suffer physical damage such as a cracked case.\n\nHow soon a battery needs replacing depends on a number of factors, such as the number of times it’s used to start the engine. Where it lives is also a factor; although battery failure is most often associated with cold weather, hot temperatures do more to shorten battery life by evaporating the fluid and destroying cells inside the battery. Whereas a battery might last three to five years in the Northeast, it could need replacing sooner in Arizona or Florida.\n\nBatteries frequently get blamed for all sorts of electrical issues, but they’re only one part of a car’s charging system. Batteries store the electrical power that starts the engine and operates accessories, such as the lights, power locks and windows, and the stereo. The battery depends on the alternator to generate electricity and a voltage regulator to control the amount of electricity generated. If either of those components becomes worn or fails, the battery won’t be fully charged and able to do its part.\n\nThat’s why it pays it have the entire charging system checked before replacing a battery to make sure the problem isn’t somewhere else. Many parts stores (as well as repair shops) will check a battery’s state of charge and reserve capacity for free, but just replacing the battery won’t fix problems caused by the alternator, voltage regulator, or damaged electrical connectors or cables, or if the belt that drives the alternator is loose or worn.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/battery-replacement/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Charging system",
    "glossary_slug": "charging-system",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The charging system provides the electricity that powers the starter motor and runs electrical accessories, such as lights, audio system, air conditioner, window defroster and other components. Its main parts are the battery, alternator and voltage regulator. If any parts of the charging system are worn, a vehicle will be hard to start or may not start at all.\n\nThe battery stores the power that initially starts the engine, and the alternator generates the electricity that’s stored in the battery. The voltage regulator controls the amount of electricity generated to prevent overcharging and damaging the battery. Because the alternator on most engines is driven by an accessory belt, a loose or worn belt can result in too little battery charging.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/charging-system/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Check engine light diagnosis",
    "glossary_slug": "check-engine-light-diagnosis",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The \"Check Engine\" light warns drivers that something is wrong, and occurs when the computer issues an error message. A solid light means that the issue is not urgent. A flashing light means stop immediately, as soon as it's safe to stop.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/check-engine-light-diagnosis/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "D",
    "glossary_category_slug": "d",
    "glossary_short_name": null,
    "glossary_long_name": "Door window motor",
    "glossary_slug": "door-window-motor",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Power windows are almost universal in modern vehicles, and if a window doesn’t go up and down, the electric motor that supplies the power could be at fault.\n\nThe window motor is mounted inside the door panel and attached to the regulator, the mechanical assembly that does the heavy lifting to raise and lower the window.\n\nPower windows may not work for a variety of reasons, but one way to check if the motor is at fault without disassembling the door is to activate the power window switch. If you don’t hear anything, the motor or switch is probably bad. If the window raises and lowers slowly, the motor could be worn or the window tracks could be gummed up. If you can hear the motor but the window doesn’t move, the fault could be in the regulator, damaged wiring or a bad control module.\n\nOther possible causes to check before deciding you need a new window motor include the fuse or relay for the power windows, but if either of those has blown none of the windows will work.\n\nMotors aren’t usually that expensive to replace, but as with other repairs the labor time can greatly add to the cost because the door panel needs to be removed and the power window hardware removed.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/door-window-motor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "D",
    "glossary_category_slug": "d",
    "glossary_short_name": null,
    "glossary_long_name": "Door window regulator",
    "glossary_slug": "door-window-regulator",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035934581.png",
    "glossary_image_path": "door-window-regulator.jpg",
    "glossary_description": "The window regulator is the mechanical assembly that moves a window up and down when power is supplied to an electric motor or, with manual windows, the window crank is turned.\n\nWindow regulators are mounted inside the door panel, out of sight and out of mind until they don’t work. Among things that can go wrong are that a gear that drives the assembly could break, a cable or pulley can come loose or break, or the regulator carriage may no longer contact the window to guide it up and down.\n\nRegulators are often riveted to the door, so they’re not easily removed or replaced.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/door-window-regulator/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Headlamp bulb",
    "glossary_slug": "headlamp-bulb",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Headlamps come in several sizes, shapes and types, as do their bulbs, which need periodic replacing. A majority of vehicles still use halogen headlamp bulbs, but a growing number come with high-intensity-discharge lighting that uses xenon gas instead of a filament, or with a cluster of LED bulbs that have a distinctive white light.\n\nThe different types of bulbs are not usually interchangeable, but aftermarket conversion kits offer the opportunity to switch from halogen to xenon or even to LED, though that typically involves changing the wiring and adding components. Moreover, getting the full benefit of xenon or LED requires having headlamp assemblies designed for that type of bulb.\n\nHalogen bulbs are the cheapest, though more expensive replacements that claim to be brighter, more powerful and able to illuminate more of the road are available. Some of these claims are true, but federal regulations limit how far they can reach down the road. Bulbs legal for highway use can’t be so powerful they’ll blind oncoming drivers.\n\nIn addition, halogen bulbs that claim to be brighter and whiter usually don’t last as long as the original-equipment bulbs that come on new vehicles. Sylvania, for example, says its SilverStar halogen bulbs have an average life of about one year. Original-equipment bulbs are typically the “long-life” type that should last for years.\n\nXenon lights have a whiter color than halogens, with a slight bluish glow that gives them a distinctive appearance. Bulb manufacturers try to capitalize on this by offering halogen replacement bulbs that are tinted blue. Independent tests have shown, however, that these blue-tinted bulbs tend to produce less light, not more, than standard halogens, even though they’re more expensive.\n\nIn addition to being brighter, xenon bulbs use less energy than halogens and last longer, but they’re more expensive to replace and also require ballast that may need periodic replacement.\n\nLEDs are the most expensive type of headlight and generate light through semiconductors. They last longer than other types – up to 10 years, by some estimates -- and use less energy, which is one reason vehicle manufacturers are switching to them.\n\nThough LED headlamps last longer, replacing them because of an accident or other damage is likely to be more expensive than replacing other types would be.\n\nAs with xenon lights, several companies offer kits to convert halogen systems to LEDs, though these kits often include only one LED bulb that fits into the original socket. LED systems typically use several bulbs arranged in a pattern to generate sufficient lighting, and experts warn that a single LED bulb doesn’t produce as much light as a single halogen and is not a good substitute.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/headlamp-bulb/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "I",
    "glossary_category_slug": "i",
    "glossary_short_name": null,
    "glossary_long_name": "Ignition cap",
    "glossary_slug": "ignition-cap",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The ignition (or distributor) cap is where ignition wires that run to the spark plugs receive high-voltage current from the ignition coil. Metal contacts in the cap connect with contacts in the ignition wires to form an electrical link, and the current is passed along to each spark plug according to its firing order.\n\nThis type of ignition system with a separate ignition coil -- a rotor in a distributor that sends electrical current to each spark plug through wires in the cap -- began to phase out in the 1970s. Most modern ignition systems don’t need a distributor because of advances in electronic controls. They have separate ignition coils for each cylinder that connect directly to the spark plugs or, in some instances, one coil for every two cylinders and short ignition wires from the coils to the spark plugs.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ignition-cap/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "I",
    "glossary_category_slug": "i",
    "glossary_short_name": null,
    "glossary_long_name": "Ignition wire set",
    "glossary_slug": "ignition-wire-set",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Older vehicles with distributor-type ignition systems use ignition (or spark plug) wires to send electrical current from the distributor to individual spark plugs, with the timing based on their firing order. A separate wire runs from the ignition distributor cap to each spark plug -- actually thick cables capable of carrying 40,000 volts or more. One end of each wire has a boot designed to fit snugly on the cap, while the other end has a boot that fits onto the spark plug.\n\nIgnition wires often need to be replaced as part of an engine “tune-up” because the wires can crack or the electrical contacts can wear out, making it hard to start a car or causing the engine to run roughly or sluggishly. Driving for extended periods with bad ignition wires can also damage catalytic converters",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ignition-wire-set/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "P",
    "glossary_category_slug": "p",
    "glossary_short_name": null,
    "glossary_long_name": "Power door lock actuator",
    "glossary_slug": "power-door-lock-actuator",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The behind-the-scenes mechanism that locks and unlocks your vehicle’s doors with the push of a button is the power door-lock actuator. Mounted inside the door, it includes an electric motor, gears and linkage, or a cable that extends or retracts to operate the lock.\n\nOn many modern vehicles, the lock actuators are monitored by electronic controls (such as the body control module) that have to receive the correct antitheft code from a key fob transmitter before they’ll send electrical current to unlock the doors. Each door has its own power lock actuator, and the motor turns in one direction to lock the doors and the other to unlock them. The linkage typically has a hook on the end that moves the lock up or down, making it similar to having a permanently installed “Slim Jim.”\n\nActuators can stop working or develop intermittent problems because electrical contacts or circuits wear out, dirt gums up the gears or the motor fails from long-term use.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/power-door-lock-actuator/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Starter",
    "glossary_slug": "starter",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036805816.png",
    "glossary_image_path": "starter.jpg",
    "glossary_description": "The starter is an electric motor that uses power from the battery to turn the flywheel and crankshaft and start the engine.\n\nThe crankshaft holds the connecting rods and pistons, so it requires a healthy starter motor and strong battery to move all that metal and get the engine going -- a job that’s more difficult in cold weather because the engine oil is thicker. Once the engine is running, the starter motor disengages.\n\nStarters wear out and electrical connections can come loose or fail, but starter motors often last for the life of a vehicle. If the engine doesn’t crank when trying to start it, the starter may not be the culprit. Instead, the battery could be dead or the ignition switch may be broken. If the lights, wipers, stereo and other electrical accessories work but the engine doesn’t crank, then the starter could be the cause.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/starter/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "W",
    "glossary_category_slug": "w",
    "glossary_short_name": null,
    "glossary_long_name": "Windshield washer pump",
    "glossary_slug": "windshield-washer-pump",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "This is the pump that delivers windshield wiper fluid to your windshield.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/windshield-washer-pump/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "W",
    "glossary_category_slug": "w",
    "glossary_short_name": null,
    "glossary_long_name": "Wiper motor",
    "glossary_slug": "wiper-motor",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Windshield wipers are powered by a small electric motor, usually mounted on the firewall or under the cowl (the area under the windshield’s base). The motor activates linkage that moves the wiper arms back and forth. On vehicles with a rear window wiper, a separate motor powers the one in the rear.\n\nSigns that a wiper motor is about to fail include slow or intermittent operation, wipers that will operate at only one speed, or arms that stop in the middle of the windshield when turned off.\n\nIf your wipers don’t work, the fault could also lie with other parts of the wiper system. In the winter, for example, trying to use the wipers when the blades are stuck to the windshield because of ice or snow can blow the fuse for the motor or trip a circuit breaker.\n\nOther possible causes are the interior switch that controls the wipers failing, wires in the system being damaged, or the linkage that pushes and pulls the wiper arms breaking. Moving parts in the linkage may also be stuck from corrosion and/or gunk and need lubrication.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/wiper-motor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "D",
    "glossary_category_slug": "d",
    "glossary_short_name": null,
    "glossary_long_name": "Diesel injection pump",
    "glossary_slug": "diesel-injection-pump",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Diesel engines operate at higher compression ratios than gasoline engines, and fuel is injected under much higher pressure. An injection pump, usually driven by a belt or chain linked to the crankshaft, does this by supplying fuel under high pressure (15,000 pounds per square inch or more) to the injectors for each cylinder.\n\nAs with gasoline engines, diesel injection pumps are controlled by the engine control module in order to deliver the correct amount of fuel at the right time for each cylinder. With diesel engines, fuel is injected directly into the cylinder, while in most gas engines it’s injected into an intake port (though there are a growing number of gas engines with direct injection).\n\nDiesel engine pumps can be damaged by sludge and other deposits, they can develop leaks and electrical parts can fail. A worn injection pump will make a diesel engine harder to start and is often accompanied by a loss of power, though a faulty fuel supply pump or dirty fuel filters could also be the cause. They are usually expensive to replace, ranging up to a few thousand dollars. That’s why many diesel owners buy remanufactured pumps or have their original pump rebuilt.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/diesel-injection-pump/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "E",
    "glossary_category_slug": "e",
    "glossary_short_name": null,
    "glossary_long_name": "Engine oil light diagnosis",
    "glossary_slug": "engine-oil-light-diagnosis",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "This dashboard light illuminates when there's been a loss of oil pressure. If it lights up, stop driving and investigate. Driving with no oil pressure can wreck a car's internal parts in minutes. Or less.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/engine-oil-light-diagnosis/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "G",
    "glossary_category_slug": "g",
    "glossary_short_name": null,
    "glossary_long_name": "Glow plug",
    "glossary_slug": "glow-plug",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036021650.png",
    "glossary_image_path": "glow-plug.jpg",
    "glossary_description": "Diesel engines run on fuel that’s much thicker than gas, adding to the difficulty of cold-weather starts. To aid combustion, small electric heaters called glow plugs warm pre-combustion or combustion chambers of a cold diesel engine before it’s started so that the fuel is easier to ignite. Diesels don’t have spark plugs, so the air-fuel mixture is ignited by compression.\n\nTo start a cold diesel engine, a driver typically has to turn the ignition to the On position to activate the glow plugs then wait several seconds before starting the engine. Glow plugs aren’t needed once a diesel engine reaches its normal operating temperature.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/glow-plug/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "I",
    "glossary_category_slug": "i",
    "glossary_short_name": null,
    "glossary_long_name": "Ignition lock cylinder",
    "glossary_slug": "ignition-lock-cylinder",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The ignition lock cylinder is a mechanical part where the ignition key is inserted to start a vehicle. It’s mounted inside the ignition switch, the electrical component that locks the ignition and “reads” anti-theft coding in the key to allow the vehicle to start.\n\nWorn keys can damage “wafer” tumblers or pins inside the lock cylinder so that the key can’t turn, preventing the ignition from unlocking. The wafers themselves can wear down (so much so that in some cases the key can be removed while the engine is running), break or stick in a raised position, preventing the key from rotating.\n\nIf the ignition lock cylinder is difficult to turn or the key can’t easily be inserted or pulled out, the key might be bent or worn. Having a new master key made by a dealer or locksmith -- not a duplicate based on the worn-out key -- may help.\n\nSome lock cylinders can be repaired by locksmiths by replacing or smoothing wafers. In cases where an ignition lock cylinder has to be replaced, the vehicle will also need new keys and new locks for the doors and trunk.\n\nIgnition lock cylinders typically last several years before problems develop, and they will likely be less of an issue in the future as more vehicles now are equipped with smart keys and push-button start that eliminate the need for a conventional key.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ignition-lock-cylinder/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "I",
    "glossary_category_slug": "i",
    "glossary_short_name": null,
    "glossary_long_name": "Ignition switch",
    "glossary_slug": "ignition-switch",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Most drivers think of the ignition switch as the slot where they insert the key to start their car, but that’s actually the ignition lock cylinder. The ignition switch is a more complex electrical component that has to “read” anti-theft coding in the key before it will activate electrical systems in the vehicle so the vehicle can start or allow an automatic transmission to be shifted out of Park.\n\nOn vehicles with push-button start, the ignition switch has to recognize the anti-theft code transmitted by the key fob before it will allow the engine to start.\n\nIf nothing happens when the key is turned in the ignition lock or no dashboard lights come on when it’s turned to the On position, those are signs that an ignition switch has failed or there’s a problem with the wiring from the switch to the starter or other electrical components. Those could also be signs of other problems, such as a failed starter motor or a dead battery.\n\nAnother potential issue is that a heavy key ring can cause wear on the lock cylinder and the ignition switch, allowing the switch to turn to the Off position when a car hits a bump or pothole, disabling the power-steering, air bags and other systems. That’s what led to General Motors recalling 2.6 million vehicles in 2014 to replace the ignition switch, lock cylinder and keys.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ignition-switch/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Oil pan",
    "glossary_slug": "oil-pan",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1427734416043.png",
    "glossary_image_path": "oil-pan.jpg",
    "glossary_description": "The oil pan is attached to the bottom of the engine with bolts and is the reservoir for oil that gets pumped throughout the engine to lubricate, clean and cool moving parts. A pump forces the oil from the pan through a filter to remove dirt and other debris before it circulates through the engine.\n\nThe pan is usually made of steel or aluminum and typically holds from four to six quarts of oil, depending on the engine. The oil dipstick extends into the oil pan and measures the oil level in the reservoir. A drain plug on the bottom can be removed to drain oil.\n\nOil leaks are common on engines as they accumulate miles, and oil pans can be one source of leaks or seepage. Gaskets or seals installed where the pan attaches to the engine block may wear out and allow leaks. Drain plugs can leak if they are over-tightened or, in some cases, if washers aren’t replaced when the oil is changed.\n\nPans also can be damaged when a vehicle goes off-road (whether intentionally or by accident) and hits a rock or other hard object.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/oil-pan/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Oil pump",
    "glossary_slug": "oil-pump",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036701401.png",
    "glossary_image_path": "oil-pump.jpg",
    "glossary_description": "An engine needs oil to lubricate moving parts, prevent corrosion, collect dirt and sludge, and absorb some of the heat generated by a running engine. The oil pump provides the force that delivers oil through galleries and passages around the engine.\n\nOil pumps are usually either inside the oil pan and driven by a camshaft or outside the pan and driven by a crankshaft. When those engine parts start moving, the pump starts working at the same time to pump oil to reduce friction and wear between moving parts and prevent the engine from seizing. If an oil pump stops working, or there is little or no oil because of leaks, engine parts can overheat in a matter of seconds and seize from a lack of lubrication.\n\nChecking or replacing an oil pump is not part of routine service or maintenance, but because it’s critical to an engine any warning signs should be addressed immediately. An illuminated oil system warning light (usually red with the outline of a vintage oil can) or low-pressure indication on an oil pressure gauge are signs that the oil level is extremely low, the pump is not operating at normal speed or there’s a related problem that needs prompt attention.\n\nWhen a warning light comes on, the best approach is to shut the engine off, wait several minutes and check the oil level. If the oil level is normal and the warning light comes on again when the engine is restarted, continuing to run the engine increases the risk of major damage.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/oil-pump/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Overheated engine",
    "glossary_slug": "overheated-engine",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Most engines operate at roughly 190-210 degrees Fahrenheit, and temperatures inside combustion chambers can reach 4,500 degrees. To keep their cool, engines need a steady and ample supply of coolant (a mixture of antifreeze and water), air and engine oil, plus a well-functioning support team of hoses, a water pump, a radiator and thermostat, plus other components.\n\nIf any part of the cooling system breaks down, an engine can quickly overheat, causing hot metal parts to warp or even seize from heat and friction. Here are some typical causes of overheating:\n\n- Radiators and hoses can develop leaks, so over time there will be too little coolant to circulate throughout the engine and absorb heat.\n\n- Radiators can get blocked by plastic bags, dirt and other debris that restricts the flow of air that’s supposed to cool the coolant as it passes through.\n\n- Thermostatically controlled fans that draw outside air through the radiator can fail.\n\n- A thermostat that’s supposed to open to allow coolant to flow through the radiator may get stuck in the closed position, or the water pump that keeps the coolant flowing around the engine can leak or fail. In either case, the coolant stuck in jackets and passages in the engine will eventually overheat.\n\n- A radiator cap that doesn’t seal tightly lowers the boiling point of the coolant, causing an engine to overheat. Most vehicles are supposed to have a 50-50 mix of antifreeze and water, and if there’s too little antifreeze that also lowers the boiling point.\n\nAmong other problems that can cause overheated engines are failed cylinder head gaskets, which allow coolant to leak into combustion chambers; blocked exhaust systems; “dragging” brakes that don’t release when the pedal is released; and towing or hauling more weight than the cooling system is designed to handle.\n\nThough engine oil is not part of the cooling system, it does perform a cooling function by reducing friction between moving parts. In addition, as it gets pumped around the engine it absorbs some heat. An engine that’s low on oil by a couple of quarts or more will run hotter and could eventually overheat.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/overheated-engine/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "R",
    "glossary_category_slug": "r",
    "glossary_short_name": null,
    "glossary_long_name": "Rear main seal",
    "glossary_slug": "rear-main-seal",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The rear main seal keeps oil sealed inside the rear of the engine, where the crankshaft connects with the transmission. It can be expensive to repair, often $600 or more, because it typically involves removing the transmission and, in some cases, all or part of the engine.\n\nOn most front-wheel-drive vehicles the engine is mounted transversely, so the rear of the engine is the end opposite the one with the pulleys and drive accessory belt. An oil leak from the main seal, also known as the rear crankshaft seal, will usually drip from where the transmission connects to the engine, though it may show up elsewhere, such as on the oil pan.\n\nRear main seals can be made of rubber or silicone, and they can wear out because of age, the rotational forces of the crankshaft, corrosion from road salt and other environmental factors.\n\nThe traditional fix for a leaking main seal is to replace it, but because of the typically high labor cost some vehicle owners use oil additives designed to restore seals. In some cases, that can stop or slow leaks. Other drivers may switch to a heavier oil, such as 10W30 instead of 5W20. Mechanics frequently advise that when a transmission has to be removed for any reason, that’s a good time to replace the rear main seal, even if it isn’t leaking, because much of the disassembly work involved will already be done.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/rear-main-seal/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Timing belt",
    "glossary_slug": "timing-belt",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The timing belt is a notched rubber belt, sometimes called a Gilmer belt. This belt allows the crankshaft to drive the camshaft, which in turn opens and closes the valves. Without this belt, the engine can't run.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/timing-belt/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Thermostat",
    "glossary_slug": "thermostat",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036912404.png",
    "glossary_image_path": "thermostat.jpg",
    "glossary_description": "The thermostat cuts off the flow of coolant to the radiator when the engine is cold so that heat generated by the engine warms the coolant. Once the coolant warms to a specific level, a valve in the thermostat is supposed to open so that coolant flows through the radiator to cool off before being pumped back through the engine in a continuous cycle.\n\nIf a thermostat is open all the time, the coolant will constantly be circulating through the radiator and the engine will take longer to warm up as a result. If a thermostat is stuck in the closed position, the engine could overheat because coolant isn’t circulating through the radiator and shedding some heat. In either case, the thermostat should be replaced.\n\nEven if the thermostat opens and closes when it’s supposed to, the housing gasket could develop a leak and need replacing. The thermostat is typically located where the upper radiator hose enters the engine.\n\nThermostat replacement usually isn’t listed in vehicle maintenance schedules, and some mechanics advise that as long as it’s working there’s no need to replace it. On the other hand, if the coolant is being flushed at, say, 100,000 miles, or radiator hoses are being replaced, many repair shops will suggest replacing the thermostat at the same time.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/thermostat/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Throttle body",
    "glossary_slug": "throttle-body",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The throttle body is a housing with a valve that regulates airflow into an engine’s intake manifold. The throttle body resembles the base of a carburetor, and some low-cost fuel-injection systems had one or two injectors inside the throttle body instead of an injector for each cylinder, and that was where air mixed with fuel. On multi-point injection systems, with one or more injectors for each cylinder, only air passes through the throttle body.\n\nMany drivers think “wide-open throttle” means flooring the gas pedal. That’s correct, but flooring the pedal opens a throttle blade as wide as it can go, allowing more air into the engine. When more air goes in, more gas (or diesel) goes into the engine with it, producing more power and speed. Dirt can build up in a throttle body and cause sluggish acceleration, hard starting or stalling, so the body needs to be cleaned as part of fuel system maintenance.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/throttle-body/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Throttle position sensor",
    "glossary_slug": "throttle-position-sensor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036958480.png",
    "glossary_image_path": "throttle-position-sensor.jpg",
    "glossary_description": "The throttle position sensor monitors how far open the throttle valve (or blade) is open, which is determined by how far down the accelerator pedal has been pushed. The throttle position controls the amount of air that flows into an engine’s intake manifold; when it’s opened wide more air flows in; when it’s nearly closed, little air flows in.\n\nThe position of the throttle and how quickly it’s opening or closing is transmitted to the engine control module, and that information is among the factors the computer uses to decide how much fuel is injected into the engine and the spark timing.\n\nThe TPS is usually mounted on the throttle body (the housing that contains the throttle valve). When a TPS malfunctions it can trigger a “check engine” warning light or cause the engine to idle roughly, surge, hesitate or stall because the engine control module doesn’t know what the throttle position is and can’t correctly set the fuel mixture or ignition timing.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/throttle-position-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "V",
    "glossary_category_slug": "v",
    "glossary_short_name": null,
    "glossary_long_name": "Vacuum leak",
    "glossary_slug": "vacuum-leak",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "The pumping of an engine’s pistons creates a vacuum in the cylinders, and that vacuum is filled by air drawn in through the intake system. If leaks develop in hoses or engine parts downstream from the air intake, that means additional air is going into the engine that’s not being “read” by the engine computer, which determines how much fuel to inject into the cylinders based on the amount of air coming in.\n\nThe result is an incorrect air-fuel mixture than can create a number of problems, such as hard starting, a rough idle, hesitation, misfiring or a drop in fuel economy -- issues that could, without proper diagnosis, seem to have other causes, such as incorrect ignition timing or fouled spark plugs. A vacuum leak can trigger a “check engine” light because the fuel system is running too “lean,” meaning it has a greater mix of air than is ideal.\n\nVacuum leaks can develop in many locations, including the intake manifold, throttle body evaporative emissions system, power brake booster, and several other places, because some vehicles have a multitude of vacuum hoses.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/vacuum-leak/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Canister purge valve",
    "glossary_slug": "canister-purge-valve",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724318045.png",
    "glossary_image_path": "canister-purge-valve.jpg",
    "glossary_description": "In the charcoal canister, the purge valve is the opening that releases fuel vapors that were absorbed by the charcoal back into the engine for combustion.\n\nA failed purge valve is one of many causes for check engine lights, and it is often difficult for mechanics to diagnose.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/canister-purge-valve/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Catalytic converter",
    "glossary_slug": "catalytic-converter",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725879171.png",
    "glossary_image_path": "catalytic-converter.jpg",
    "glossary_description": "The catalytic converter is located upstream of the muffler, close to the engine, and it changes environmentally damaging pollutants in the exhaust stream into more benign gases. Under extreme heat, precious metals in a honeycomb structure catalyze the chemical reactions; they make today’s vehicles dramatically cleaner than older vehicles.\n\nCatalytic converters can be both causes and victims of check engine lights. A failing “cat” can trigger a check engine light and/or produce an unpleasant exhaust odor, but converter failure is often caused by abnormal combustion and rough engine operation, sometimes accompanied by a blinking check engine light. Because of its precious metals content, converters are expensive to replace and often targeted by thieves.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/catalytic-converter/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Charcoal canister",
    "glossary_slug": "charcoal-canister",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725827190.png",
    "glossary_image_path": "charcoal-canister.jpg",
    "glossary_description": "Part of the car’s emissions controls, this charcoal-filled canister’s job is to absorb fuel vapor that would otherwise vent out to the atmosphere, causing pollution. Vapors trapped by the charcoal are released back into the engine through the purge valve and then burned.\n\nCharcoal canister problems can often cause the check engine light to go on, and they are often difficult for mechanics to diagnose.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/charcoal-canister/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "E",
    "glossary_category_slug": "e",
    "glossary_short_name": null,
    "glossary_long_name": "Exhaust manifold",
    "glossary_slug": "exhaust-manifold",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724366739.png",
    "glossary_image_path": "exhaust-manifold.jpg",
    "glossary_description": "Bolted directly to the engine block, the exhaust manifold is the first section of a vehicle’s exhaust system. It funnels exhaust gases from all the cylinders and routes them to the car’s catalytic converter. V-type engines have a separate manifold for each cylinder bank.\n\nA leak in the exhaust manifold or its gasket can allow exhaust gases to escape, which poses a health hazard to the car’s occupants and can result in erroneous readings by the oxygen sensor, triggering a check engine light. Larger holes in a manifold will produce loud exhaust noise.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/exhaust-manifold/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "E",
    "glossary_category_slug": "e",
    "glossary_short_name": null,
    "glossary_long_name": "Exhaust manifold gasket",
    "glossary_slug": "exhaust-manifold-gasket",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415725961617.png",
    "glossary_image_path": "exhaust-manifold-gasket.jpg",
    "glossary_description": "The exhaust manifold gasket is sandwiched between the engine block and exhaust manifold.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/exhaust-manifold-gasket/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "F",
    "glossary_category_slug": "f",
    "glossary_short_name": null,
    "glossary_long_name": "Fuel tank pressure sensor",
    "glossary_slug": "fuel-tank-pressure-sensor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035980819.png",
    "glossary_image_path": "fuel-tank-pressure-sensor.jpg",
    "glossary_description": "The fuel tank pressure sensor is part of the fuel pump assembly and is mounted on top of the tank or inside the tank. It’s part of the evaporative emissions system (commonly referred to as “EVAP”) and reads pressure in the fuel system to detect evaporative leaks, such as a loose or faulty gas cap. Fuel vapors are supposed to be contained in the EVAP system, and leaks can allow vapors to escape into the atmosphere.\n\nThe sensor is connected to the engine computer, and when the sensor detects a leak, or if the sensor itself fails, it illuminates the “check engine” light. Mechanics can read a trouble code to trace it to a leak in the evaporative emissions system or the sensor.\n\nFixing an evaporative leak may not require removing the fuel tank, but checking or replacing a faulty sensor usually does.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/fuel-tank-pressure-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "K",
    "glossary_category_slug": "k",
    "glossary_short_name": null,
    "glossary_long_name": "Knock sensor",
    "glossary_slug": "knock-sensor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724412057.png",
    "glossary_image_path": "knock-sensor.jpg",
    "glossary_description": "The engine’s knock sensor (or sensors) detects preignition and detonation, potentially damaging forms of abnormal combustion. Though full-blown knocking and pinging are audible to the human ear, the knock sensor detects imperceptible levels. When knocking is detected, the engine’s computer can retard the spark plug timing to prevent it.\n\nIn the event of knock sensor failure, the driver may experience audible knocking or pinging and/or diminished acceleration, which is sometimes accompanied by decreased gas mileage. A check engine light is a likely result.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/knock-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "M",
    "glossary_category_slug": "m",
    "glossary_short_name": null,
    "glossary_long_name": "Map sensor",
    "glossary_slug": "map-sensor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036628242.png",
    "glossary_image_path": "map-sensor.jpg",
    "glossary_description": "The manifold absolute pressure sensor reads the amount of pressure or vacuum (also called “engine load”) in the intake manifold, where outside air is divvied up in proper amounts and distributed to each cylinder. This pressure reading is shared with the engine control module to determine how much fuel needs to be fed to each cylinder, as well as to determine ignition timing.\n\nA fully functioning MAP sensor is necessary to maintain the right combination of acceleration, fuel economy, emissions and engine smoothness. When the throttle is wide open and air is rushing into the intake manifold (causing a drop in pressure), the MAP sensor signals the engine computer to send more fuel. When the throttle closes, pressure rises and readings from the MAP sensor tell the computer to reduce the amount of fuel going into the engine.\n\nA faulty MAP sensor will usually trigger a “check engine” warning light. Other signs of a bad MAP sensor include rough idling, sluggish acceleration or hesitation, poor fuel economy or black smoke coming out the exhaust. Not only can the sensor fail, but vacuum hoses can develop leaks or electrical contacts can fail, triggering the warning light or causing other issues.\n\nSome vehicles use a mass air flow sensor instead of a MAP sensor to measure the amount of air going to the intake manifold.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/map-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Oxygen sensor",
    "glossary_slug": "oxygen-sensor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726005249.png",
    "glossary_image_path": "oxygen-sensor.jpg",
    "glossary_description": "As the name suggests, oxygen sensors in a car’s exhaust system sniff for oxygen, the presence of which indicates incomplete combustion and unchecked pollution. This can trigger the check engine light.\n\nWhile oxygen sensors can faithfully diagnose improper engine operation, failed sensors are themselves among the most common causes of check engine light illumination.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/oxygen-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "Air filter",
    "glossary_slug": "air-filter",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035525653.png",
    "glossary_image_path": "air-filter.jpg",
    "glossary_description": "Engine air filters are mounted in the air intake system to catch dirt and other particles that could damage internal engine parts. They’re usually made of paper (some are made of cotton or other materials) and should be replaced according to your manufacturer’s maintenance schedule. A dirty or clogged air filter will restrict air going into the engine, which in turn restricts the amount of fuel injected. The EPA says the main result is a loss of acceleration, with minimal impact on fuel economy.\n\nMost modern cars also have a cabin air filter that catches dirt, debris and some allergens in the air that goes through the heating, ventilation and air-conditioning systems. Cabin air filters also need periodic changing, sometimes more frequently than engine air filters.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/air-filter/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "Automatic transmission fluid",
    "glossary_slug": "automatic-transmission-fluid",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Like other vital automotive fluids, transmission fluid deteriorates over time. Hard use - such as frequent stop-and-go city driving, hauling heavy loads, trailer towing - will accelerate the deterioration. That kind of driving raises the operating temperature of the transmission, and heat puts more strain on the transmission and the fluid, which helps facilitate gear shifts, cools the transmission and lubricates moving parts.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/automatic-transmission-fluid/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Haldex fluid/filter",
    "glossary_slug": "haldex-fluidfilter",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Vehicles with Haldex all-wheel-drive systems (manufactured by Haldex but installed in various vehicles under different names) use specific fluid and filters designed for those AWD systems. On many vehicles with Haldex AWD, the fluid and filter are supposed to be changed periodically (as often as every two years), though some recent models come with a “lifetime” filter that doesn’t need periodic changing.\n\nHaldex systems are primarily used on front-drive-based vehicles with transverse engines. The Haldex coupling (or clutch), located at the rear differential, enables power to be automatically distributed among the wheels as needed to maintain traction.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/haldex-fluidfilter/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Oil & filter change",
    "glossary_slug": "oil-filter-change",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Oil change intervals vary by manufacturer and engines, so consult your owner's manual or maintenance schedule to see how often to change the oil in your vehicle and what type of oil to use. You may be surprised. We were surprised to learn that the Camry's 2.5-liter engine requires 0W20 synthetic oil, for instance. Manufacturers suggest you change oil more often for \"severe\" driving conditions, such as frequent trailer towing, extensive stop-go driving or idling in traffic, driving in extreme heat or cold, or frequent short-distance driving in which the engine doesn't reach full operating temperature.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/oil-and-filter-change/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Oil leak diagnosis",
    "glossary_slug": "oil-leak-diagnosis",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Engine oil that's leaked can be amber (if it's fresh), brown or -- if it hasn't been changed for 10,000 miles -- black, and it will leave slickness on your fingers that's hard to wipe off. Oil can leak from gaskets and seals on the front or rear of an engine, from valve covers or from the oil pan underneath, so there are several possibilities.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/oil-leak-diagnosis/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "O",
    "glossary_category_slug": "o",
    "glossary_short_name": null,
    "glossary_long_name": "Oil service",
    "glossary_slug": "oil-service",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Oil change intervals vary by manufacturer and engines, so consult your owner's manual or maintenance schedule to see how often to change the oil in your vehicle and what type of oil to use. You may be surprised. We were surprised to learn that the Camry's 2.5-liter engine requires 0W20 synthetic oil, for instance. Manufacturers suggest you change oil more often for \"severe\" driving conditions, such as frequent trailer towing, extensive stop-go driving or idling in traffic, driving in extreme heat or cold, or frequent short-distance driving in which the engine doesn't reach full operating temperature.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/oil-service/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "Automatic transmission",
    "glossary_slug": "automatic-transmission",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727451142.png",
    "glossary_image_path": "automatic-transmission.jpg",
    "glossary_description": "An automatic transmission is any transmission that doesn’t require the driver to shift gears. There are more types of automatic transmissions than ever before, including conventional torque-converter step-gear automatics, dual-clutch automatics (sometimes called automated manuals), continuously variable automatic transmissions and hybrids. Although different in design, their performance can be remarkably alike to the casual driver. Though manual shifting (with paddle shifters) is now a common feature, the automatic functionality and lack of a third pedal mean that a car is an automatic.\n\nOver the years, automatic transmissions have been gaining gears but losing dipsticks. Current models reach as high as nine speeds, and a dipstick for checking the transmission fluid has become rare. Many automatic transmissions are sealed or can be checked only by a mechanic. Always refer to your car’s owner’s manual for the proper service intervals.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/automatic-transmission/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Clutch",
    "glossary_slug": "clutch",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727614039.png",
    "glossary_image_path": "clutch.jpg",
    "glossary_description": "Clutches operate behind the scenes in many transmissions, including automatics, but the word clutch typically refers to the component that connects and disconnects the engine’s rotating crankshaft to a traditional manual transmission. It disconnects when the driver depresses the clutch pedal, selects a gear using the stick shift and re-engages when the pedal is released.\n\nBecause the clutch disk is stationary when the transmission is put into First gear or Reverse, it withstands tremendous initial friction when it contacts the engine’s spinning flywheel, moving the car forward. It’s typical for a clutch to require replacement at least once in the car’s lifetime, depending on one’s driving style. Clutch failure can also involve the mechanical or hydraulic connection between the pedal and the transmission.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/clutch/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "M",
    "glossary_category_slug": "m",
    "glossary_short_name": null,
    "glossary_long_name": "Manual transmission",
    "glossary_slug": "manual-transmission",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727680725.png",
    "glossary_image_path": "manual-transmission.jpg",
    "glossary_description": "A manual transmission is one with a stick for shifting gears and a third pedal for operating a clutch. Many automatic transmissions now enable manual shifting, and one style is even known as an “automated manual” because of its underlying design, but their automatic operation are what set them apart from a true manual transmission.\n\nThough manuals now can have as many as seven speeds, they remain similar under the skin. Once the key to higher mpg, manuals no longer have this advantage. Thanks to technology and high gear counts, automatics are often more efficient and are sometimes maintenance-free. Depending on driving style, manual transmissions tend to require clutch replacements with time and use.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/manual-transmission/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Transmission",
    "glossary_slug": "transmission",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727651428.png",
    "glossary_image_path": "transmission.jpg",
    "glossary_description": "The transmission serves three main roles:\n\nIt connects and disconnects the motor from the rest of the drivetrain (drive shafts, axles, wheels).\nIt provides gearing that allows the engine’s limited range of operation to take the car from a standstill to high speeds.\nIt allows the driver to change direction from forward to backward.\nAdditionally, transmissions can serve to hold the car in place when it’s off, either in the Park setting (automatics) or by remaining in gear (manuals).\n\nThanks to tech advancements for both transmissions and lubricants, many of today’s transmissions require less maintenance, or less frequent maintenance, than they used to. See more detail in the automatic transmission and manual transmission entries.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/transmission/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "A",
    "glossary_category_slug": "a",
    "glossary_short_name": null,
    "glossary_long_name": "Alternator",
    "glossary_slug": "alternator",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726903450.jpg",
    "glossary_image_path": "alternator.jpg",
    "glossary_description": "The alternator is a generator that produces electricity to power the car’s ignition system, lights and accessories. The engine drives the alternator by means of a belt, either with a dedicated belt or a belt shared with other pulley-driven components.\n\nAn alternator will stop immediately if its drive belt breaks, but alternators can also fail over time and with use, requiring replacement. Failing alternators can result in repeatedly drained batteries, dimming headlights and localized noise.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/alternator/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Camshaft",
    "glossary_slug": "camshaft",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415746199209.png",
    "glossary_image_path": "camshaft.jpg",
    "glossary_description": "The camshaft is a rotating shaft (or shafts) in an engine that activates the intake and exhaust valves for each cylinder. As the shaft turns, cams along its length press down on the spring-loaded valves in synchronicity with the motion of the pistons and firing of the spark plugs. An engine may have one camshaft to operate all the valves or separate shafts for intake and exhaust valves. Overhead-camshaft engines have separate shafts for each cylinder bank, so a V-configuration engine like a V-6 or V-8 can have two or four camshafts.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/camshaft/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "C",
    "glossary_category_slug": "c",
    "glossary_short_name": null,
    "glossary_long_name": "Cylinder head gasket",
    "glossary_slug": "cylinder-head-gasket",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726961193.png",
    "glossary_image_path": "cylinder-head-gasket.jpg",
    "glossary_description": "The cylinder head gasket provides a seal between the engine block and the head that caps the cylinders. The gasket not only contains the pressure of controlled explosions within the cylinders but also isolates the cylinders, oil and cooling channels from each other.\n\nHead gaskets can fail due to age and miles, or as a result of overheating. Telltale signs include rough initial engine operation when cold, overheating, white exhaust smoke (not to be confused with simple engine vapor in cold weather) or the presence of oil in engine coolant. Coolant leaking into the cylinders can damage the engine and destroy the catalytic converter, at a substantial cost.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/cylinder-head-gasket/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "D",
    "glossary_category_slug": "d",
    "glossary_short_name": null,
    "glossary_long_name": "Drive belt",
    "glossary_slug": "drive-belt",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726693459.png",
    "glossary_image_path": "drive-belt.jpg",
    "glossary_description": "Reinforced rubber drive belts allow the engine’s rotating crankshaft to drive components such as water pumps, alternators, air-conditioning compressors, power-steering pumps or superchargers. The vehicle may use separate belts for one or more components or hit multiple pulleys with a snaking serpentine belt.\n\nBelts are relatively inexpensive items that are best replaced when worn, damaged or simply old rather than after they fail. Serpentine belts in particular, because they power so many components, disable the car completely when they break.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/drive-belt/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "F",
    "glossary_category_slug": "f",
    "glossary_short_name": null,
    "glossary_long_name": "Fuel filter",
    "glossary_slug": "fuel-filter",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727014033.png",
    "glossary_image_path": "fuel-filter.jpg",
    "glossary_description": "The fuel filter traps debris that could clog or damage the fuel injectors or engine. Fuel filters are usually located in the fuel line where it meets the fuel injection system at the engine or just in front of the rear wheels attached to the frame, but some cars use a filter only in the fuel tank itself.\n\nManufacturers usually set a replacement interval for fuel filters, though the period can vary widely. A clogged filter can occur at any time, however, and can result in a check engine light or rough engine performance.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/fuel-filter/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "F",
    "glossary_category_slug": "f",
    "glossary_short_name": null,
    "glossary_long_name": "Fuel injector",
    "glossary_slug": "fuel-injector",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726751843.png",
    "glossary_image_path": "fuel-injector.jpg",
    "glossary_description": "The tip of the fuel-system spear, fuel injectors incorporate an electronically controlled valve and a nozzle that sprays fuel into each of an engine’s intake ports, or directly into its cylinders. Now the norm for more than 20 years, fuel injection has practically eliminated the complications of cold starts, engine flooding and altitude sensitivity.\n\nFuel injector failure might appear as rough engine performance and/or hesitation, likely accompanied by the check engine light. Fuel leaks are another possible, and dangerous, sign of failure, often at the seal where the injector meets the engine.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/fuel-injector/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "F",
    "glossary_category_slug": "f",
    "glossary_short_name": null,
    "glossary_long_name": "Fuel pump",
    "glossary_slug": "fuel-pump",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727045873.png",
    "glossary_image_path": "fuel-pump.jpg",
    "glossary_description": "The fuel pump sends fuel from the gas tank to the engine. In modern cars, fuel pumps are usually electrically powered and located directly in or on the fuel tank.\n\nThe ease and cost of replacement depends on the car’s design, and it should be undertaken only after determining the problem isn’t electrical or related to the fuel lines.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/fuel-pump/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "F",
    "glossary_category_slug": "f",
    "glossary_short_name": null,
    "glossary_long_name": "Fuel system",
    "glossary_slug": "fuel-system",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727083875.png",
    "glossary_image_path": "fuel-system.jpg",
    "glossary_description": "A vehicle’s fuel system comprises components that deliver fuel from the tank to the engine, including a fuel pump, fuel lines, a fuel-pressure regulator, fuel filter and fuel injectors.\n\nFuel system components are built to last, so the fuel filter is the only part that’s likely to require replacement on a schedule.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/fuel-system/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "I",
    "glossary_category_slug": "i",
    "glossary_short_name": null,
    "glossary_long_name": "Ignition coil",
    "glossary_slug": "ignition-coil",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726804773.png",
    "glossary_image_path": "ignition-coil.jpg",
    "glossary_description": "The ignition coil converts the vehicle’s 12 volts to the more than 10,000 volts required to produce an effective spark in the spark plugs, which in turn ignite the air-fuel mixture in an engine’s cylinders. Some cars use one coil, but increasingly, each cylinder bank, pair or even individual cylinder get its own coil.\n\nA failing coil can result in anything from rough operation or diminished acceleration to a complete engine stall (or a failure to start).",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ignition-coil/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "I",
    "glossary_category_slug": "i",
    "glossary_short_name": null,
    "glossary_long_name": "Ignition system",
    "glossary_slug": "ignition-system",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727167443.png",
    "glossary_image_path": "ignition-system.jpg",
    "glossary_description": "The ignition system’s job is to ignite the air-fuel mixture in a gasoline engine. In addition to the spark plugs that spark in the combustion chambers, the ignition system consists of an ignition coil, which converts battery voltage to higher voltage, and the spark plug wires that join these components.\n\nAdvancements have greatly reduced the need for ignition system service. Where distributor caps and rotors once needed replacement, electronic ignitions typically keep on firing. In new vehicles, spark-plug replacement intervals are often around 100,000 miles. Spark plug wires still require attention and occasional replacement, though an individual coil-on-plug eliminates those wires entirely.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ignition-system/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "M",
    "glossary_category_slug": "m",
    "glossary_short_name": null,
    "glossary_long_name": "Mass airflow sensor",
    "glossary_slug": "mass-airflow-sensor",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727234902.png",
    "glossary_image_path": "mass-airflow-sensor.jpg",
    "glossary_description": "A device in the throttle body, the mass airflow, or MAF, sensor helps the engine computer determine the proper air-fuel mixture by measuring the mass of the air flowing past it. Because a precise mixture is crucial to efficiency and clean combustion, the MAF sensor accounts for differences in air density, which varies with temperature and altitude.\n\nA failed MAF sensor is one of many events that will trigger a check engine light. It may also result in rough running, stalling or a drop in gas mileage.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/mass-airflow-sensor/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "P",
    "glossary_category_slug": "p",
    "glossary_short_name": null,
    "glossary_long_name": "PCV valve",
    "glossary_slug": "pcv-valve",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727349839.png",
    "glossary_image_path": "pcv-valve.jpg",
    "glossary_description": "The positive crankcase ventilation valve releases exhaust gas and unburned fuel from the engine block into the intake manifold. All engines allow some exhaust gases, unburned fuel and oil to “blow by” the pistons and collect in the crankcase where it produces sludge if not eliminated. Separating the crankcase from the intake manifold, which is a source of varying air pressure, the PCV valve maintains the optimal level of vacuum in the crankcase to extract the products of blow-by as well as potentially damaging moisture.\n\nAutomakers may designate a replacement interval. The valve is an inexpensive, easily replaced example of the dozens of parts that can elicit a check engine light and associated vexing investigation. It can also be the source of oil leaks.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/pcv-valve/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Spark plug",
    "glossary_slug": "spark-plug",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415727382667.png",
    "glossary_image_path": "spark-plug.jpg",
    "glossary_description": "Spark plugs, which screw into the top of an engine’s cylinders, create the electric spark required to ignite the compressed air-fuel mixture in gas-powered engines. The right type of plug and the size of the gap between the electrodes at the tip are specified by the automaker, and using the right ones are crucial to proper performance.\n\nA fouled, worn or loose plug can cause rough running or abnormal noises. Longer replacement intervals, typically around 100,000 miles in newer cars, have simplified plug maintenance, but they’ve also led manufacturers to justify making them more labor-intensive and expensive than ever to replace.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/spark-plug/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "B",
    "glossary_category_slug": "b",
    "glossary_short_name": null,
    "glossary_long_name": "Ball joint",
    "glossary_slug": "ball-joint",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431035361527.png",
    "glossary_image_path": "ball-joint.jpg",
    "glossary_description": "Ball joints act like hinges and connect the suspension control arms to the steering knuckles with a rotating, spherical stud and a socket, giving the wheels a wide range of movement -- from side to side for steering and up and down for going over bumps.\n\nSome vehicles have upper and lower front ball joints, and depending on the suspension design either can be the load-bearing joint that carries the vehicle’s weight (load-bearing joints tend to wear out sooner). Vehicles with McPherson strut suspensions have only lower ball joints, and some vehicles also have rear ball joints.\n\nMost vehicles come with sealed ball joints that don’t need periodic lubrication (“greasing” them used to be a routine part of oil changes), but the internal lubrication or seals can wear out over time.\n\nWhen ball joints wear, they allow too much suspension movement, resulting in shimmies or shakes on smooth roads, steering that wanders from straight ahead, or uneven tire wear. They may give audible warnings that they need to be replaced by squeaking or clunking, especially over bumps or when turning. Some ball joints have wear indicators, but mechanics can also determine if they’re worn by jacking up the vehicle and seeing if there’s excessive play by rocking the wheel back and forth.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/ball-joint/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "H",
    "glossary_category_slug": "h",
    "glossary_short_name": null,
    "glossary_long_name": "Half shaft",
    "glossary_slug": "half-shaft",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726258110.png",
    "glossary_image_path": "half-shaft.jpg",
    "glossary_description": "A half shaft is essentially a drive axle, and it’s so named because it does half of the job, extending from a transaxle or differential to one of the wheels. Its twin on the other side completes the set.\n\nBecause they’re simply shafts, half shafts age well, but the joints that connect them on either end in independent suspension vehicles are subject to significant wear. The most prudent maintenance for these systems is to maintain the integrity of the CV joint boots, which are rubber sleeves around the constant velocity joints. The boots keep grease in and debris out. A torn or missing boot allows for accelerated wear.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/half-shaft/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "P",
    "glossary_category_slug": "p",
    "glossary_short_name": null,
    "glossary_long_name": "Power steering hose",
    "glossary_slug": "power-steering-hose",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724483877.png",
    "glossary_image_path": "power-steering-hose.jpg",
    "glossary_description": "Power-steering hoses connect the steering pump to the rack-and-pinion assembly where pressurized fluid helps to push the rack left and right.\n\nWorn or damaged steering hoses are common sources of steering-fluid leaks.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/power-steering-hose/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "P",
    "glossary_category_slug": "p",
    "glossary_short_name": null,
    "glossary_long_name": "Power steering pump",
    "glossary_slug": "power-steering-pump",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726078932.png",
    "glossary_image_path": "power-steering-pump.jpg",
    "glossary_description": "The power-steering pump pressurizes the hydraulic fluid that helps the driver turn the steering wheel.\n\nSigns of steering-pump failure include leaks, noises or decreased assistance while steering. The immediate loss of power assist is more likely a sign of a broken drive belt or the loss of steering fluid. Most vehicles employ this type of mechanical/ hydraulic power steering, but because their pumps rob power and efficiency even when the car isn’t turning, a small percentage of cars use an electric pump and many new vehicles now have electric power assist.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/power-steering-pump/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "R",
    "glossary_category_slug": "r",
    "glossary_short_name": null,
    "glossary_long_name": "Rotate tires",
    "glossary_slug": "rotate-tires",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Most vehicle manufacturers recommend that the tires be rotated on the same schedule as oil changes. In most cases that means every 7,500 miles or six months, though some have stretched the oil-change interval to 10,000 miles, such as on many Fords, Volkswagens and Toyotas. BMW allows up to 15,000 miles between oil changes, but that is too long to wait to rotate the tires. Unless you drive fewer than about 7,500 miles per year, you should probably rotate tires every six months or so.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/rotate-tires/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Shock absorber",
    "glossary_slug": "shock-absorber",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724542766.png",
    "glossary_image_path": "shock-absorber.jpg",
    "glossary_description": "The “shock” is a suspension component that controls the up-and-down motion of a vehicle’s wheels. Though the devices provide some shock absorption, the job of absorbing shocks is handled mostly by the springs. More accurately called dampers, “shocks” damp excessive motion, keeping the vehicle’s body from bouncing down the road.\n\nCars with worn-out shock absorbers illustrate what the devices are meant to do, because they tend to bounce continuously. Worn-out shocks compromise a car’s roadholding and braking. The bounce test is a time-honored method of checking shock-absorber health, but mechanics might also spot oil leaking from the shock, which means the component is starting to fail and should be replaced. Uneven tire wear is another sign of shock failure.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/shock-absorber/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Steering gearbox",
    "glossary_slug": "steering-gearbox",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036842550.png",
    "glossary_image_path": "steering-gearbox.jpg",
    "glossary_description": "The steering gearbox contains the gears that transmit the driver’s steering inputs to the steering linkage that turns the wheels, and it multiplies the driver’s steering changes so that the front wheels move more than the steering wheel.\n\nMost car-based vehicles use rack-and-pinion steering in which the steering wheel turns a pinion gear that moves on a rack to turn the front wheels. Others use recirculating ball systems in which ball bearings are mounted on a “worm”-type steering gear.\n\nThough steering gears often last for the life of a vehicle, the gearbox can develop leaks or the gearbox case can crack. Among the signs that a steering gearbox needs repair or replacement are increased or jerky steering effort, and the steering becoming loose and showing excessive play.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/steering-gearbox/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Steering rack",
    "glossary_slug": "steering-rack",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726125330.png",
    "glossary_image_path": "steering-rack.jpg",
    "glossary_description": "Part of a rack-and-pinion steering system, the rack is a bar parallel to the front axle that moves left or right when the steering wheel is turned, aiming the front wheels in the correct direction. The pinion is a small gear at the end of the vehicle’s steering column that engages the rack.\n\nThough steering racks are hearty, they sometimes require replacement. Signs of a failing rack include difficulty turning the steering wheel in one direction but not the other, jerkiness of motion or noises.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/steering-rack/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Strut",
    "glossary_slug": "strut",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726437359.png",
    "glossary_image_path": "strut.jpg",
    "glossary_description": "Officially a MacPherson strut, named after its creator, a strut is a type of shock absorber that has a structural role in a vehicle’s suspension. The strut includes a shock absorber element, but it also serves to position the wheels, a task handled by control arms in a conventional suspension design that employs dedicated shock absorbers.\n\nLike shocks, struts can lose their ability to damp bounces and compromise the car’s roadholding and braking. Mechanics might spot oil leaking from the strut, which means the component is on its way out and should be replaced. Uneven tire wear is another potential sign that the shock-absorber component is failing. Because of their size and complexity, struts are more expensive to replace than shock absorbers.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/strut/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Strut bearing",
    "glossary_slug": "strut-bearing",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1431036878980.png",
    "glossary_image_path": "strut-bearing.jpg",
    "glossary_description": "On many vehicles with strut-type suspension designs, the front struts (which include the springs and shock absorbers) are mounted with bearings or bearing plates that serve as the upper pivot points for the steering.\n\nThe bearings can wear out from long-term use, corrosion, impact or collision damage, and other factors. When they do, they often make knocking or clunking noises over bumps or in turns, or the steering becomes stiff or snaps back toward center when the driver lets go of the steering wheel. Bad strut bearings can also cause alignment issues and uneven tire wear.\n\nMany mechanics recommend that strut bearings be replaced whenever struts are replaced so worn bearings don’t affect suspension or steering performance. Some replacement parts come as a complete assembly with struts, springs, bearing plates and mounting hardware. In addition, strut assemblies should be replaced in pairs, not just one side at a time, and the vehicle should also get a wheel alignment after the struts and/or bearing plates are replaced.\n\nOne advantage of buying a complete strut assembly instead of individual parts is that with the complete kit, removing and installing the strut assembly doesn’t require a spring compressor, a tool that can cause serious injury when not used properly.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/strut-bearing/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "S",
    "glossary_category_slug": "s",
    "glossary_short_name": null,
    "glossary_long_name": "Sway bar end link",
    "glossary_slug": "sway-bar-end-link",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415724799825.png",
    "glossary_image_path": "sway-bar-end-link.jpg",
    "glossary_description": "Sway bar end links are the attachment points between a sway bar and suspension members. Also known as a stabilizer bar or anti-roll bar, the sway bar connects suspension components on either side of the car to minimize body leaning in turns.\n\nThough the sway bars themselves are made of long-lasting, durable steel, the end links incorporate bushings that can fail with age and wear. That can introduce play that causes noise, compromises the sway bar’s effectiveness and may lead to separation. Inboard sway bar bushings, which serve as a hinge, also must be maintained properly.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/sway-bar-end-link/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Tie rod",
    "glossary_slug": "tie-rod",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726852653.png",
    "glossary_image_path": "tie-rod.jpg",
    "glossary_description": "Tie rods connect either end of the steering rack to the steering knuckles on which the front wheels pivot when the steering wheel is turned. The tie rod has two sections threaded together, so their length can be adjusted and the front wheels aligned. The outer section, typically called the tie rod end, is most susceptible to wear and failure.\n\nThough tie rod ends historically required regular lubrication, they are among many aspects of a modern vehicle’s chassis that are now maintenance-free. When they fail, however, they can throw off the car’s alignment, cause premature tire wear or, in the worst cases, separate and cause a loss of control.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/tie-rod/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "T",
    "glossary_category_slug": "t",
    "glossary_short_name": null,
    "glossary_long_name": "Transfer case",
    "glossary_slug": "transfer-case",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "On four-wheel-drive vehicles, the transfer case contains gears that connect a second drive shaft to send power to all four wheels instead of just the front or rear ones.\n\nThe transfer case on some vehicles, particularly those intended for off-road use, are engaged by a separate gear lever or electric buttons or a rotary switch on the dashboard. Most off-road 4WD vehicles have transfer-case positions for rear-wheel drive; 4WD High, for on-road operation; and 4WD Low, for off-road and demanding on-road use.\n\nAll-wheel-drive vehicles often don’t have a transfer case lever or switch; instead, AWD engages or disengages automatically based on driving conditions. Some transfer cases have the ability to send all the power to either the front or rear when needed.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/transfer-case/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "W",
    "glossary_category_slug": "w",
    "glossary_short_name": null,
    "glossary_long_name": "Wheel alignment",
    "glossary_slug": "wheel-alignment",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Depending on the vehicle, proper wheel alignment involves setting the camber (inward or outward tilt of the wheels when looking head on), caster (wheel tilt front or back looking from the side) and toe-in or toe-out (looking down at the wheels from above). The adjustments are measured in fractions of an inch and require specialized alignment equipment. Wheel alignment isn't usually listed by vehicle manufacturers on the recommended maintenance schedule, so how often it should be done is open-ended. If your vehicle tracks as straight as an arrow, you're wheels likely are properly aligned. Even so, it's a good idea to have your alignment checked annually, such as when you have your tires rotated.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/wheel-alignment/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "W",
    "glossary_category_slug": "w",
    "glossary_short_name": null,
    "glossary_long_name": "Wheel bearing",
    "glossary_slug": "wheel-bearing",
    "glossary_image_url": null,
    "glossary_image_path": null,
    "glossary_description": "Wheels turning at 800 revolutions per mile can generate a lot of friction and heat. Roller-type or ball bearings packed in grease inside all four wheel hubs allow wheels to spin freely without generating excessive heat while supporting the weight of the vehicle. In addition, by reducing friction they improve fuel economy.\n\nMost wheel bearings are sealed and don’t need regular maintenance, but some need fresh grease periodically. They typically last more than 100,000 miles. Bearings can also be damaged by hitting potholes or curbs or in an accident.\n\nThey can also fail, often because seals wear out and allow grease to escape and dirt and moisture to enter. When they do fail, they often make a roaring or rumbling noise. On vehicles with sealed bearings, the entire hub assembly must be replaced when the bearings fail.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/wheel-bearing/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  },
  {
    "glossary_category_url": null,
    "glossary_category_name": "W",
    "glossary_category_slug": "w",
    "glossary_short_name": null,
    "glossary_long_name": "Wheel bearings",
    "glossary_slug": "wheel-bearings",
    "glossary_image_url": "https://images.cars.com/cldstatic/wp-content/uploads/1415726463450.png",
    "glossary_image_path": "wheel-bearings.jpg",
    "glossary_description": "Wheels turning at 800 revolutions per mile can generate a lot of friction and heat. Roller-type or ball bearings packed in grease inside all four wheel hubs allow wheels to spin freely without generating excessive heat while supporting the weight of the vehicle. In addition, by reducing friction they improve fuel economy.\n\nMost wheel bearings are sealed and don’t need regular maintenance, but some need fresh grease periodically. They typically last more than 100,000 miles. Bearings can also be damaged by hitting potholes or curbs or in an accident.\n\nThey can also fail, often because seals wear out and allow grease to escape and dirt and moisture to enter. When they do fail, they often make a roaring or rumbling noise. On vehicles with sealed bearings, the entire hub assembly must be replaced when the bearings fail.",
    "glossary_detail_url": "https://www.cars.com/auto-repair/glossary/wheel-bearings/",
    "glossary_source_site": "https://www.cars.com/auto-repair/glossary/"
  }
]