[
  {
    "brand_name": "BMW",
    "brand_slug": "bmw",
    "brand_detail_url": "https://www.autoevolution.com/bmw/",
    "brand_image_url": "https://s1.cdn.autoevolution.com/images/producers/bmw-sm.jpg",
    "brand_image_path": "BMW.jpg",
    "brand_detail_url_en": "https://www.autoevolution.com/bmw/",
    "brand_description_en": "Contrary to some opinions, BMW does not stand for Best Motors in the World company. Sure, BMW-branded automobiles are regarded as being some of the few engineering forms close to perfection, but the letters stand for something less boisterous and more good-natured: Bayerische Motoren Werke or Bavarian Motor Works.\n\nThe secret to their success does not lie in precise astrological predictions or mischievous and blatant employ of corporate espionage, but rather in a dedication to quality and constant pursuit of excellence. Unlike most of the auto manufacturers out there, BMW hasn't focused on a vehicle as a whole but started from its primary source of power, the engine, which has been perfected by generations of engineers over a close-to-a-century time span. The 'cardio-approach' BMW took resulted into obscenely efficient performance-happy engines that literally rocketed the company formed by Karl Friedrich Rapp in October 1913 straight to the sky.\n\nRapp's company, 'Rapp-Motorenwerke' - that would later become BMW - focused mainly on aircraft engines due to the large demand at the time, fueled by the imminence of Wold War I. Despite the need for aircraft engines, Rapp failed to sale his powerplants due to a reliability flaw caused by unwanted engine vibrations. However, his neighbor Gustav Otto, who was also the owner of an aircraft engine plant, enjoyed a great deal of success.\n\nStruggles to keep 'Rapp-Motorwerke' afloat failed and, by 1916, Karl Rapp resigned under the weight of the financial difficulties that had been pressing against the factory's lungs for a few years. As in the case of other car brands, such as Bentley or Aston Martin, expected and highly predicable 'Hollywoodian' rescuers came along and fended off the threats. Austrian triumvirate formed by new company owners Franz-Josef Popp and financier Camillo Castiglioni relaunched the Motoren Werke by persuading Gustav Otto into a merger that would prove mutually beneficial. Thus, the 'Bayerische Flugzeug-Werke' or BFW was formed.\n\nShortly after the new entity was born, its name turned into the murmur of what would later become a shout-out for quality automobiles: BMW. By the time the 20's came with the Charleston and its afferent bizarre fashion sense, BMW had already developed a range of highly-appreciated airplane engines that had garnered tons of acclaim - especially after the 1918-improved Type IIIA engine successfully powered a biplane to the impressive height of 16,404 feet in a mere 29 minutes.\n\nThe beginning of the 20's also happily slapped BMW with its still unchanged to this day logo, mimicking the motion of a white propeller on a sky-blue background. While enjoying the heights of an appreciated and sought for brand, BMW was brutally pulled back to earthy existence once the World War was over. The Treaty of Versailles prohibited BMW from continuing its activity and the company switched to manufacturing air brakes for railway cars.\n\nForced by the Versailles-imposed conditions, the company found itself searching for other alternatives and soon enough came to focus on developing motorcycle engines. Over a two-year period of time (from 1920 to 1922), BMW built two motorcycle models, the Victoria and the Flink. Their success was consequently marked by the building of the first BMW factory, that would further kick the brand to new heights.\n\nAlthough BMW motorcycles encountered sales problems due to defective suspension, the company still managed to hold a constant leading position in aeronautical engineering. By 1927 the company was the proud  holder of just over one third of the aviation records of those time, with an astonishing 29 out of an overall 87. Two-wheeled vehicles quickly turned into four-wheeled ones in 1928, when the Austin license-built Dixi 3/15 rolled out the factory doors.\n\nOnly one year later, BMW made the headlines once again, this time by setting a new motorcycle-speed record through their Ernst Henne ridden 750 cc bike, that reached the speed of 134.65 mph (216.75 km/h).\n\nSwinging from breaking world records to engineering innovations, BMW hit the bull's eye once more in 1932, with the launch of their new car model, the 3/20 PS. The 782 cc 4 cylinder powered car was the first one independently produced by BMW. Shortly after the waves of acclaim generated by the new machine, the company announces its next model, the 303 saloon, that would bring a persistent trait in all future BMW engine configurations: the 6 cylinder one.\n\nOnly years after the launch of the 303 in 1933, BMW continued its world record breaking streak, at the same time with the beginning of a new chapter in its cylinder-powered existence: the development of the company's first roadster, the 328 model (1936), and a row of motor sport wins over the following two years.\n\nAs time passed by, BMW got bigger and bigger and, shortly before the Wold War II outbreak, took over some more factories in the vicinity of Berlin. More motor sport wins were to follow, with Baron Fritz Huschke von Kanstein winning the Mille Miglia race in 1940s. \n\nNeedless to mention, war necessities threw the company into military equipment production policies once more. Despite the lengthy world conflict, BMW developed some of its greatest pieces of machinery, such as the R57 Wehrmacht military motorcycle, as well as the 109-300 jet engine which was one of the first jet engines in the world to enter mass production.\n\nAfter recovering from the 1944 bombings that heavily damaged their plant in Munich, BMW received permission to repair Allied army motorized equipment at their plant in Allach. Due to BMW's versatility and need for mechanized faming implements and spare parts, the first BMW bicycle was born. Soon after the genesis of the leg-powered two-wheeled vehicle, BMW received a hard blow from the US army, that had ordered the dismantling of the Munich and Allach plants.\n\nAfter a 5-year absence from the Germany industry, BMW returned in style. Crossing the ocean all the way to New York, BMW debuted their first motorcycle in almost 2 decades - following their last one at the beginning of the 40's. More success awaited in the line for BMW, as their R68 motorcycle model developed in the 50's quickly became a standard-setter among international motorcycle manufacturers. Meanwhile a previous model, the  R67/2, reached the 100,000 threshold in 1953. \n\nBMW receives further acclaims in the years to come, as it establishes itself as an engineering force to be reckoned with. The 1955 Isetta, powered by a 12/13 hp motorcycle engine, becomes a favorite among customers. The result? Over 160,000 units are sold, transforming the Isetta into a symbol of the post-war decade.\n\nBesides coming up with newer models and bending technological improvements on their cars, BMW also held a privileged position among race winners around the world. After the development of the 507 and 600 models, BMW unleashed a shout of childish joy, grabbing an impressive win in the 1958 Austrian GP, through Ernst Hiller.\n\nWith the help of Herbert Quandt, BMW, still a share-owned company, is brought one step closer to independence. Exterior offers of selling or fusion were turned down despite the enormous profits such a transaction would have led to. The 700 model entered the production lines, together with the R69, BMW's top motorcycle line-up model.\n\nThe 60's brought a multitude of achievements with the 1500 and 1600 series, as well as a range of new sedans, the 2500, 2800, American Bavaria and the 2.5 CS and 2800 CS coupe models. BMW proved once more that it hasn't left its king-of-the-hill-of-racing spot, as Austrian racing driver Dieter Quester scored several victories in the Formula Two series (as well as a triple European touring car champion title in 1968, 1969 and 1977).\n\nHowever, BMW did not stop there. After having bestowed a great deal of mechanics magic upon the world, the company resumed its entertainment through development and unveiled the 2002 Turbo model in 1973. Following the success of its earlier aircraft engine, the 2002 Turbo is one of the first ever turbos to enter mass-production.\n\nProduction lines that would become worldwide pieces of success soon came out, such as the 6 and 7 series and the recently reconstructed BMW M1 model. By the end of the 70's, BMW had dug deep into other car-improvement related fields as well, and electronics proved to be the perfect ground for growing BMW's next generation of computerized car devices. Economic fuel research then became top priority. Not only the company was quick in adapting to the fast-moving tendencies of those times, but it also became a steady and reliable supplier of armored cars for different private and public clients.\n\nRacing never lost its fans, consequently BMW never lost enthusiasm in racing. The 80's marked (finally) BMW's involvement in Formula One racing. It was in 1983 that BMW was handed its first title in the series, with Brazilian driver Nelson Piquet becoming king of the Formula One World Racing Championship. At the same time, the 5 series entered a new enhancement stage and was gifted the 518i engine and the powerful M535i. 'M' set a new standard in power and stamina. The M5 and M3 models launched in 1985 and 1986 consequently joined the pinnacle of engineering accuracy and true power and beauty among sports cars enthusiasts.\n\nResearch started to be heavily reinforced and reached new uncharted areas through the employment of over 6,000 people. Once the Z1 one came along, the profits kept pile-up trend. Caring for the customer and staying ahead of competition was proof enough that BMW had turned into a true, mature brand. Expansion was inevitable and much like a Big Bang, BMW spreads across the world and inaugurated a new car plant in the US, namely in Spartanburg, South Carolina. The models that were in production at the time slowly received touring versions, which helped BMW cover an even larger slice of the market.\n\nBMW would later reveal the Z8, a successor of the 507, who later made it to the movies. The world wasn't enough and so were BMW's achievements in their own vision. Since 1999, they have been constantly delivering performance vehicles or 'motorized attire' for their wealthy customers out there. Racing has remained a pleasurable and profitable hobby for the German marque, which emerged victorious in three consecutive FIA WTCC seasons from 2005 to 2007. Only recently, BMW engineers and designers paid homage to the M1 through a modern day replica of the sharp-angled 70's original. Sadly enough, the M1 will not be revived through mass production.",
    "brand_detail_url_de": "https://www.autoevolution.com/de/autos/bmw/",
    "brand_description_de": "Entgegen mancher Meinung steht BMW nicht für Best Motors in the World. Sicher, die Automobile der Marke BMW gelten als einige der wenigen Konstruktionsformen, die der Perfektion nahe kommen, aber die Buchstaben stehen für etwas weniger ausgelassenes und gutmütigeres: Bayerische Motoren Werke oder Bayerische Motorenwerke.\n\nDas Geheimnis ihres Erfolges liegt nicht in präzisen astrologischen Vorhersagen oder schelmischen und unverhohlenen Einsatz von Wirtschaftsspionage, sondern in der Hingabe an Qualität und dem ständigen Streben nach Exzellenz. Im Gegensatz zu den meisten Automobilherstellern hat sich BMW nicht auf ein Fahrzeug als Ganzes konzentriert, sondern von seiner primären Kraftquelle, dem Motor, der von Generationen von Ingenieuren über einen Zeitraum von fast einem Jahrhundert perfektioniert wurde. Der'Cardio-Ansatz' von BMW führte zu obszönen, leistungsfreudigen Motoren, die das von Karl Friedrich Rapp im Oktober 1913 gegründete Unternehmen buchstäblich in die Höhe schnellen ließen.\n\nRapps Firma Rapp-Motorenwerke - später BMW - konzentrierte sich aufgrund der damals großen Nachfrage, die durch den drohenden Ersten Weltkrieg ausgelöst wurde, vor allem auf Flugzeugtriebwerke. Sein Nachbar Gustav Otto, der auch Eigentümer eines Flugzeugtriebwerks war, war jedoch sehr erfolgreich.\n\nDer Kampf um den Erhalt der Rapp-Motorwerke scheiterte und Karl Rapp trat 1916 unter dem Druck der finanziellen Schwierigkeiten zurück, die sich seit einigen Jahren gegen die Lunge der Fabrik richteten. Wie bei anderen Automarken, wie Bentley oder Aston Martin, kamen erwartete und gut vorhersagbare\"Hollywood-Retter\" vorbei und wehrten die Bedrohungen ab. Das österreichische Triumvirat aus den neuen Firmeninhabern Franz-Josef Popp und dem Finanzier Camillo Castiglioni hat die Motoren Werke neu aufgelegt und Gustav Otto zu einer für beide Seiten vorteilhaften Fusion überredet. So entstanden die Bayerischen Flugzeug-Werke (BFW).\n\nKurz nach der Geburt des neuen Unternehmens wurde sein Name zum Rauschen dessen, was später zu einem Ruf nach Qualitätsautomobilen werden sollte: BMW. Als die 20er Jahre mit dem Charleston und dem dazugehörigen bizarren Modesinn kamen, hatte BMW bereits eine Reihe von hochgeschätzten Flugzeugmotoren entwickelt, die tonnenweise Anerkennung fanden - besonders nachdem der 1918 verbesserte Typ IIIA-Motor in nur 29 Minuten einen Doppeldecker auf die beeindruckende Höhe von 16.404 Fuß gebracht hatte.\n\nAnfang der 20er Jahre schlug auch BMW mit seinem bis heute unveränderten Logo, das die Bewegung eines weißen Propellers auf einem himmelblauen Hintergrund nachahmt. Während er die Höhen einer geschätzten und gesuchten Marke genoss, wurde BMW nach dem Ende des Weltkrieges brutal ins Erdenleben zurückgezogen. Der Vertrag von Versailles verbot BMW die Fortsetzung seiner Tätigkeit und das Unternehmen stellte auf die Herstellung von Druckluftbremsen für Eisenbahnwaggons um.\n\nDurch die in Versailles auferlegten Bedingungen war das Unternehmen auf der Suche nach anderen Alternativen und konzentrierte sich schon bald auf die Entwicklung von Motorradmotoren. Über einen Zeitraum von zwei Jahren (von 1920 bis 1922) baute BMW zwei Motorradmodelle, die Victoria und die Flink. Ihr Erfolg war folglich durch den Bau des ersten BMW-Werks geprägt, das die Marke weiter in die Höhe treiben sollte.\n\nObwohl BMW Motorräder aufgrund einer defekten Federung auf Absatzprobleme stießen, konnte das Unternehmen dennoch eine konstante Spitzenposition in der Luftfahrttechnik einnehmen. Bis 1927 war das Unternehmen stolzer Besitzer von etwas mehr als einem Drittel der damaligen Luftfahrtrekorde, mit erstaunlichen 29 von insgesamt 87. Aus zweirädrigen Fahrzeugen wurden 1928 schnell vierrädrige, als der in Austin in Lizenz gebaute Dixi 3/15 die Werkstüren ausrollte.\n\nNur ein Jahr später sorgte BMW erneut für Schlagzeilen, diesmal mit einem neuen Motorrad-Geschwindigkeitsrekord durch das von Ernst Henne gefahrene 750er Motorrad, das eine Geschwindigkeit von 134,65 mph (216,75 km/h) erreichte.\n\nVom Weltrekord zur technischen Innovation: 1932 schlug BMW mit der Einführung des neuen Automodells 3/20 PS erneut ins Schwarze. Der 782 ccm 4-Zylinder-Motorwagen war der erste von BMW unabhängig produzierte Wagen. Kurz nach den Wellen der Anerkennung durch die neue Maschine, kündigt das Unternehmen sein nächstes Modell, die 303 Limousine, die eine dauerhafte Eigenschaft in allen künftigen BMW-Motor-Konfigurationen bringen würde: die 6-Zylinder ein.\n\nNur Jahre nach der Markteinführung des 303 im Jahr 1933 setzte BMW seinen Weltrekord fort und begann gleichzeitig mit der Entwicklung des ersten Roadsters, des Modells 328 (1936), und einer Reihe von Motorsport-Erfolgen in den folgenden zwei Jahren.\n\nIm Laufe der Zeit wurde BMW immer größer und übernahm kurz vor dem Ausbruch des Zweiten Weltkriegs weitere Fabriken in der Nähe von Berlin. Weitere Siege im Motorsport sollten folgen, wobei Baron Fritz Huschke von Kanstein das Mille-Miglia-Rennen in den 1940er Jahren gewann. \n\nUnnötig zu erwähnen, dass die Kriegsnotwendigkeiten das Unternehmen erneut in die Produktionspolitik für militärische Ausrüstungen stürzten. Trotz des langwierigen Weltkonflikts entwickelte BMW einige seiner größten Maschinen, wie das Militärmotorrad R57 der Wehrmacht, sowie das 109-300er Strahltriebwerk, das als eines der ersten Strahltriebwerke der Welt in Serie ging.\n\nNach der Bergung der Bombenanschläge von 1944, die ihr Werk in München schwer beschädigt hatten, erhielt BMW die Erlaubnis, die motorisierte Ausrüstung der Alliierten Armee in ihrem Werk in Allach zu reparieren. Aufgrund der Vielseitigkeit von BMW und des Bedarfs an mechanischen Geräten und Ersatzteilen wurde das erste BMW Fahrrad geboren. Bald nach der Entstehung des Zweiradfahrzeugs mit Beinantrieb erhielt BMW einen harten Schlag von der US-Armee, die die Demontage der Werke München und Allach angeordnet hatte.\n\nNach 5 Jahren Abwesenheit von der deutschen Industrie kehrte BMW mit Stil zurück. Über den Ozean bis nach New York, debütierte BMW sein erstes Motorrad seit fast 2 Jahrzehnten - nach seinem letzten Anfang der 40er Jahre. Mehr Erfolg wartete in der Linie für BMW, als das in den 50er Jahren entwickelte Motorradmodell R68 schnell zum Standardsetter unter den internationalen Motorradherstellern wurde. Inzwischen hat ein Vorgängermodell, der R67/2, 1953 die 100.000er-Schwelle erreicht. \n\nBMW wird in den kommenden Jahren weiter gefeiert, da es sich als Engineering-Kraft etabliert, mit der man rechnen muss. Die 1955er Isetta, angetrieben von einem 12/13 PS starken Motorradmotor, wird zum Favoriten unter den Kunden. Das Ergebnis? Über 160.000 verkaufte Einheiten machen die Isetta zu einem Symbol der Nachkriegszeit.\n\nNeben neueren Modellen und technologischen Verbesserungen an ihren Fahrzeugen hatte BMW auch eine privilegierte Position unter den Rennsiegern auf der ganzen Welt. Nach der Entwicklung der 507er und 600er Modelle löste BMW einen Schrei kindlicher Freude aus und holte durch Ernst Hiller einen eindrucksvollen Sieg beim Österreichischen GP 1958.\n\nMit Hilfe von Herbert Quandt wird BMW, noch immer ein Aktienunternehmen, der Unabhängigkeit einen Schritt näher gebracht. Externe Verkaufsangebote oder Fusionen wurden abgelehnt, trotz der enormen Gewinne, die eine solche Transaktion mit sich gebracht hätte. Das Modell 700 ging zusammen mit der R69, dem Spitzenmodell von BMW, in Serie.\n\nDie 60er Jahre brachten eine Vielzahl von Erfolgen mit den Serien 1500 und 1600, sowie eine Reihe von neuen Limousinen, die 2500, 2800, American Bavaria und die 2,5 CS und 2800 CS Coupé Modelle. BMW hat einmal mehr bewiesen, dass er seinen Platz am Berg nicht verlassen hat, denn der österreichische Rennfahrer Dieter Quester holte mehrere Siege in der Formel 2 (sowie einen dreifachen Tourenwagen-Europameistertitel in den Jahren 1968, 1969 und 1977).\n\nDoch damit nicht genug. Nachdem das Unternehmen der Welt viel Mechanik-Magie geschenkt hatte, nahm es seine Unterhaltung durch Entwicklung wieder auf und stellte 1973 das Modell Turbo 2002 vor. Nach dem Erfolg seines früheren Flugzeugtriebwerks ist der Turbo 2002 einer der ersten Turbos, die in Serie gehen.\n\nBald kamen Produktionslinien auf den Markt, die zu weltweiten Erfolgen führen sollten, wie die 6er- und 7er-Reihe und das kürzlich rekonstruierte BMW M1-Modell. Ende der 70er Jahre hatte sich BMW auch in andere Bereiche der Fahrzeugverbesserung vertieft, und die Elektronik erwies sich als der perfekte Boden für die Entwicklung der nächsten Generation computergestützter Fahrzeuggeräte von BMW. Die wirtschaftliche Kraftstoffforschung wurde dann zur obersten Priorität. Das Unternehmen hat sich nicht nur schnell auf die schnelllebigen Tendenzen der damaligen Zeit eingestellt, sondern ist auch zu einem festen und zuverlässigen Lieferanten von gepanzerten Fahrzeugen für verschiedene private und öffentliche Auftraggeber geworden.\n\nRacing verlor nie seine Fans, daher verlor BMW nie die Begeisterung im Rennsport. Die 80er Jahre markierten (endlich) das Engagement von BMW in der Formel 1. 1983 erhielt BMW seinen ersten Titel in der Serie, wobei der Brasilianer Nelson Piquet König der Formel-1-Weltmeisterschaft wurde. Gleichzeitig trat der 5er in eine neue Ausbaustufe ein und wurde mit dem 518i-Motor und dem leistungsstarken M535i begabt, der einen neuen Standard in Leistung und Ausdauer setzte. Die Modelle M5 und M3, die 1985 und 1986 auf den Markt gebracht wurden, haben sich damit zur Spitze der technischen Präzision und wahren Kraft und Schönheit unter den Sportwagen-Enthusiasten entwickelt.\n\nDie Forschung wurde stark verstärkt und erreichte durch die Beschäftigung von über 6.000 Menschen neue, unbekannte Gebiete. Als die Z1 auftauchte, blieben die Gewinne im Aufwärtstrend. Die Sorge um den Kunden und der Vorsprung vor dem Wettbewerb waren der Beweis dafür, dass sich BMW zu einer echten, ausgereiften Marke entwickelt hat. Die Expansion war unausweichlich und wie ein Urknall verbreitet sich BMW auf der ganzen Welt und eröffnete ein neues Automobilwerk in den USA, nämlich in Spartanburg, South Carolina. Die Modelle, die damals in Produktion waren, erhielten langsam Touring-Versionen, was BMW half, einen noch größeren Teil des Marktes abzudecken.\n\nSpäter enthüllte BMW den Z8, einen Nachfolger des 507, der es später ins Kino schaffte. Die Welt war nicht genug und auch die Leistungen von BMW in ihrer eigenen Vision. Seit 1999 liefern sie für ihre wohlhabenden Kunden ständig Performance-Fahrzeuge oder\"motorisierte Kleidung\". Für die deutsche Marke, die in drei aufeinander folgenden FIA WTCC-Saisons von 2005 bis 2007 siegreich war, ist der Rennsport ein genussvolles und profitables Hobby geblieben. Erst kürzlich huldigten BMW Ingenieure und Designer dem M1 mit einer modernen Nachbildung des scharfkantigen 70er-Jahre-Originals. Leider wird der M1 nicht durch Massenproduktion wiederbelebt.",
    "brand_detail_url_fr": "https://www.autoevolution.com/fr/voitures/bmw/",
    "brand_description_fr": "Contrairement à certaines opinions, BMW ne signifie pas Best Motors in the World Company. Bien sûr, les automobiles de marque BMW sont considérées comme étant l'une des rares formes d'ingénierie proches de la perfection, mais les lettres représentent quelque chose de moins bruyant et de plus naturel : Bayerische Motoren Werke ou Bavarian Motor Works.\n\nLe secret de leur succès ne réside pas dans des prédictions astrologiques précises ou dans l'utilisation malicieuse et flagrante de l'espionnage d'entreprise, mais plutôt dans le dévouement à la qualité et la recherche constante de l'excellence. Contrairement à la plupart des constructeurs automobiles, BMW ne s'est pas concentré sur un véhicule dans son ensemble, mais a commencé à partir de sa principale source de puissance, le moteur, qui a été perfectionné par des générations d'ingénieurs au cours d'une période de temps très proche du siècle. L'\"approche cardiaque\" de BMW a donné naissance à des moteurs à l'efficacité obscène qui ont littéralement propulsé l'entreprise formée par Karl Friedrich Rapp en octobre 1913 directement dans le ciel.\n\nLa société Rapp,'Rapp-Motorenwerke' - qui deviendra plus tard BMW - se concentre principalement sur les moteurs d'avions en raison de la forte demande à l'époque, alimentée par l'imminence de la Première Guerre mondiale. Malgré le besoin de moteurs d'avions, Rapp n'a pas réussi à vendre ses moteurs en raison d'un défaut de fiabilité causé par des vibrations indésirables du moteur. Cependant, son voisin Gustav Otto, qui était également propriétaire d'une usine de moteurs d'avions, a connu beaucoup de succès.\n\nLa lutte pour maintenir le Rapp-Motorwerke à flot a échoué et, en 1916, Karl Rapp s'est résigné sous le poids des difficultés financières qui pesaient sur les poumons de l'usine depuis quelques années. Comme dans le cas d'autres marques automobiles, comme Bentley ou Aston Martin, des sauveteurs'hollywoodiens' attendus et hautement prévisibles sont arrivés et ont repoussé les menaces. Le triumvirat autrichien formé par les nouveaux propriétaires Franz-Josef Popp et le financier Camillo Castiglioni a relancé le Motoren Werke en persuadant Gustav Otto dans une fusion qui s'avérerait mutuellement bénéfique. C'est ainsi qu'est né le \"Bayerische Flugzeug-Werke\" ou BFW.\n\nPeu de temps après la naissance de la nouvelle entité, son nom s'est transformé en murmure de ce qui deviendra plus tard un cri pour des automobiles de qualité : BMW. Au moment où les années 20 sont arrivées avec le Charleston et son sens de la mode bizarre et afférent, BMW avait déjà développé une gamme de moteurs d'avion très appréciés qui avaient recueilli des tonnes d'éloges - surtout après que le moteur Type IIIA amélioré de 1918 ait propulsé avec succès un biplan à la hauteur impressionnante de 16 404 pieds en seulement 29 minutes.\n\nLe début des années 20 a également giflé BMW avec son logo encore inchangé à ce jour, imitant le mouvement d'une hélice blanche sur fond bleu ciel. Tout en profitant des hauteurs d'une marque appréciée et recherchée, BMW a été brutalement ramenée à l'existence terrestre une fois la guerre mondiale terminée. Le traité de Versailles interdit à BMW de poursuivre son activité et l'entreprise se tourne vers la fabrication de freins à air pour les wagons.\n\nForcée par les conditions imposées par Versailles, l'entreprise s'est trouvée à la recherche d'autres alternatives et s'est rapidement concentrée sur le développement de moteurs de motocyclettes. Sur une période de deux ans (de 1920 à 1922), BMW a construit deux modèles de motos, le Victoria et le Flink. Leur succès a été marqué par la construction de la première usine BMW, qui a permis à la marque d'atteindre de nouveaux sommets.\n\nBien que les motos BMW aient rencontré des problèmes de vente en raison d'une suspension défectueuse, l'entreprise a réussi à conserver une position de leader constant dans le domaine de l'ingénierie aéronautique. En 1927, l'entreprise était le fier détenteur d'un peu plus d'un tiers des records de l'aviation de l'époque, soit 29 sur un total de 87. Les véhicules à deux roues se sont rapidement transformés en véhicules à quatre roues en 1928, lorsque le Dixi 3/15 d'Austin, construit sous licence, a ouvert les portes de l'usine.\n\nSeulement un an plus tard, BMW a encore une fois fait la une des journaux, cette fois en établissant un nouveau record de vitesse à moto grâce à leur vélo 750 cc Ernst Henne, qui a atteint la vitesse de 134,65 mph (216,75 km/h).\n\nPassant des records du monde aux innovations techniques, BMW a encore une fois frappé l'oeil du taureau en 1932, avec le lancement de leur nouveau modèle de voiture, le 3/20 PS. La voiture à 4 cylindres de 782 cc a été la première voiture produite indépendamment par BMW. Peu de temps après les vagues d'acclamation générées par la nouvelle machine, l'entreprise annonce son prochain modèle, la berline 303, qui apporterait un trait persistant dans toutes les configurations futures du moteur BMW : le 6 cylindres.\n\nSeulement quelques années après le lancement de la 303 en 1933, BMW a poursuivi sa série de records du monde, tout en entamant un nouveau chapitre de son existence à cylindre : le développement du premier roadster de l'entreprise, le modèle 328 (1936), et une série de victoires dans le sport automobile au cours des deux années suivantes.\n\nAu fil du temps, BMW est devenue de plus en plus grande et, peu avant la Seconde Guerre mondiale, a pris le contrôle d'autres usines dans les environs de Berlin. Le Baron Fritz Huschke von Kanstein remporte la course Mille Miglia dans les années 1940. \n\nInutile de mentionner que les nécessités de la guerre ont poussé l'entreprise dans des politiques de production d'équipements militaires une fois de plus. Malgré le long conflit mondial, BMW a développé certaines de ses plus grandes machines, comme la moto militaire R57 Wehrmacht, ainsi que le moteur 109-300 qui a été l'un des premiers moteurs à réaction au monde à entrer dans la production de masse.\n\nAprès avoir récupéré des bombardements de 1944 qui ont lourdement endommagé leur usine de Munich, BMW a reçu l'autorisation de réparer l'équipement motorisé de l'armée alliée à leur usine d'Allach. En raison de la polyvalence de BMW et du besoin d'outils mécanisés et de pièces de rechange, la première bicyclette BMW est née. Peu après la genèse du véhicule à deux roues à jambes, BMW a reçu un coup dur de l'armée américaine, qui avait ordonné le démantèlement des usines de Munich et d'Allach.\n\nAprès 5 ans d'absence de l'industrie allemande, BMW est revenue avec style. Traversant l'océan jusqu'à New York, BMW a débuté sa première moto en près de 2 décennies - après la dernière au début des années 40. Plus de succès attendu dans la ligne pour BMW, comme leur modèle de moto R68 développé dans les années 50 est rapidement devenu un standard parmi les fabricants internationaux de motocyclettes. Entre-temps, un modèle précédent, le R67/2, a atteint le seuil des 100 000 en 1953. \n\nBMW reçoit d'autres acclamations dans les années à venir, car elle s'impose comme une force d'ingénierie avec laquelle il faut compter. L'Isetta 1955, propulsée par un moteur de moto de 12/13 ch, devient un favori parmi les clients. Le résultat ? Plus de 160 000 unités sont vendues, transformant l'Isetta en un symbole de la décennie d'après-guerre.\n\nEn plus de venir avec de nouveaux modèles et des améliorations technologiques de flexion sur leurs voitures, BMW a également tenu une position privilégiée parmi les vainqueurs de course autour du monde. Après le développement des modèles 507 et 600, BMW a lancé un cri de joie enfantine, remportant une victoire impressionnante dans le GP d'Autriche 1958, par l'intermédiaire d'Ernst Hiller.\n\nAvec l'aide d'Herbert Quandt, BMW, toujours une société anonyme, fait un pas de plus vers l'indépendance. Les offres extérieures de vente ou de fusion ont été refusées malgré les énormes profits qu'une telle transaction aurait permis de réaliser. Le modèle 700 est entré dans les lignes de production, en même temps que la R69, le modèle haut de gamme de BMW.\n\nLes années 60 ont apporté une multitude de réalisations avec les séries 1500 et 1600, ainsi qu'une gamme de nouvelles berlines, les 2500, 2800, American Bavaria et les coupés 2.5 CS et 2800 CS. BMW a prouvé une fois de plus qu'elle n'a pas quitté sa place de roi de la course, puisque le pilote autrichien Dieter Quester a remporté plusieurs victoires en Formule 2 (ainsi qu'un triple titre de champion d'Europe des voitures de tourisme en 1968, 1969 et 1977).\n\nMais BMW ne s'est pas arrêtée là. Après avoir donné beaucoup de magie mécanique au monde, l'entreprise a repris son divertissement par le développement et a dévoilé le modèle Turbo 2002 en 1973. Après le succès de son premier moteur d'avion, le Turbo 2002 est l'un des premiers turbos à entrer en production de masse.\n\nDes lignes de production qui allaient connaître un succès mondial sont rapidement apparues, comme les séries 6 et 7 et le modèle BMW M1 récemment reconstruit. À la fin des années 70, BMW a creusé profondément dans d'autres domaines liés à l'amélioration des voitures, et l'électronique s'est avérée être le terrain idéal pour la croissance de la prochaine génération de dispositifs automobiles informatisés de BMW. La recherche économique sur les carburants est alors devenue une priorité absolue. Non seulement l'entreprise s'est rapidement adaptée aux tendances de l'époque, mais elle est aussi devenue un fournisseur stable et fiable de véhicules blindés pour différents clients privés et publics.\n\nRacing n'a jamais perdu ses fans, par conséquent BMW n'a jamais perdu son enthousiasme en course. Les années 80 ont marqué (enfin) l'implication de BMW en Formule 1. C'est en 1983 que BMW a obtenu son premier titre de la série, le pilote brésilien Nelson Piquet devenant le roi du championnat du monde de Formule 1. Dans le même temps, la série 5 est entrée dans une nouvelle étape d'amélioration et a été doué le moteur 518i et le puissant M535i.'M' a établi une nouvelle norme en matière de puissance et d'endurance. Les modèles M5 et M3 lancés en 1985 et 1986 ont ainsi rejoint le sommet de la précision technique et de la vraie puissance et de la beauté chez les amateurs de voitures de sport.\n\nLa recherche a commencé à être fortement renforcée et a atteint de nouveaux domaines inexplorés grâce à l'emploi de plus de 6 000 personnes. Une fois que le Z1 est arrivé, les profits ont continué à s'accumuler. S'occuper du client et garder une longueur d'avance sur la concurrence était la preuve que BMW s'était transformée en une véritable marque mature. L'expansion était inévitable et comme un Big Bang, BMW s'étend dans le monde entier et a inauguré une nouvelle usine automobile aux États-Unis, à Spartanburg, en Caroline du Sud. Les modèles qui étaient en production à l'époque ont lentement reçu des versions tournées, ce qui a permis à BMW de couvrir une part encore plus importante du marché.\n\nBMW dévoilera plus tard la Z8, successeur de la 507, qui se rendra plus tard au cinéma. Le monde ne suffisait pas et les réalisations de BMW dans leur propre vision. Depuis 1999, ils livrent constamment des véhicules performants ou des \" vêtements motorisés \" pour leurs clients fortunés. La course est restée un passe-temps agréable et rentable pour la marque allemande, qui a remporté trois saisons consécutives du FIA WTCC de 2005 à 2007. Ce n'est que récemment que les ingénieurs et designers de BMW ont rendu hommage à la M1 par le biais d'une réplique moderne de l'original des années 70. Malheureusement, le M1 ne sera pas relancé par la production de masse."
  }
]